[{"title":"Bakewell tart","category":"Dessert","region":"British","ingList":[{"ing":"plain flour","amount":"175g/6oz"},{"ing":"chilled butter","amount":"75g/2½oz"},{"ing":"cold water","amount":"2-3 tbsp"},{"ing":"raspberry jam","amount":"1 tbsp"},{"ing":"butter","amount":"125g/4½oz"},{"ing":"caster sugar","amount":"125g/4½oz"},{"ing":"ground almonds","amount":"125g/4½oz"},{"ing":"free-range egg, beaten","amount":"1"},{"ing":"almond extract","amount":"½ tsp"},{"ing":"flaked almonds","amount":"50g/1¾oz"}],"steps":["To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough.","Roll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes.","Preheat the oven to 200C/400F/Gas 6 (180C fan).","Line the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.","For the filing, spread the base of the flan generously with raspberry jam.","Melt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.","Bake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning."],"imgUrl":"https://www.themealdb.com/images/media/meals/wyrqqq1468233628.jpg","tags":["Tart","Baking","Alcoholic"]},{"title":"Bread and Butter Pudding","category":"Dessert","region":"British","ingList":[{"ing":"butter","amount":"25g/1oz"},{"ing":"bread","amount":"8 thin slices"},{"ing":"sultanas","amount":"50g/2oz"},{"ing":"cinnamon","amount":"2 tsp"},{"ing":"milk","amount":"350ml/12fl"},{"ing":"double cream","amount":"50ml/2fl oz"},{"ing":"eggs","amount":"2 free-range"},{"ing":"sugar","amount":"25g/1oz"},{"ing":"nutmeg","amount":"grated, to taste"}],"steps":["Grease a 1 litre/2 pint pie dish with butter.","Cut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.","Arrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.","Gently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.","Crack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.","Add the warm milk and cream mixture and stir well, then strain the custard into a bowl.","Pour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.","Preheat the oven to 180C/355F/Gas 4.","Place the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown."],"imgUrl":"https://www.themealdb.com/images/media/meals/xqwwpy1483908697.jpg","tags":["Pudding","Brunch"]},{"title":"Beef Wellington","category":"Beef","region":"British","ingList":[{"ing":"mushrooms","amount":"400g"},{"ing":"English Mustard","amount":"1-2tbsp"},{"ing":"Olive Oil","amount":"Dash"},{"ing":"Beef Fillet","amount":"750g piece"},{"ing":"Parma ham","amount":"6-8 slices"},{"ing":"Puff Pastry","amount":"500g"},{"ing":"Flour","amount":"Dusting"},{"ing":"Egg Yolks","amount":"2 Beaten "}],"steps":["Put the mushrooms into a food processor with some seasoning and pulse to a rough paste. Scrape the paste into a pan and cook over a high heat for about 10 mins, tossing frequently, to cook out the moisture from the mushrooms. Spread out on a plate to cool.","Heat in a frying pan and add a little olive oil. Season the beef and sear in the hot pan for 30 secs only on each side. (You don't want to cook it at this stage, just colour it). Remove the beef from the pan and leave to cool, then brush all over with the mustard.","Lay a sheet of cling film on a work surface and arrange the Parma ham slices on it, in slightly overlapping rows. With a palette knife, spread the mushroom paste over the ham, then place the seared beef fillet in the middle. Keeping a tight hold of the cling film from the edge, neatly roll the Parma ham and mushrooms around the beef to form a tight barrel shape. Twist the ends of the cling film to secure. Chill for 15-20 mins to allow the beef to set and keep its shape.","Roll out the puff pastry on a floured surface to a large rectangle, the thickness of a £1 coin. Remove the cling film from the beef, then lay in the centre. Brush the surrounding pastry with egg yolk. Fold the ends over, the wrap the pastry around the beef, cutting off any excess. Turn over, so the seam is underneath, and place on a baking sheet. Brush over all the pastry with egg and chill for about 15 mins to let the pastry rest.","Heat the oven to 200C, 400F, gas 6.","Lightly score the pastry at 1cm intervals and glaze again with beaten egg yolk. Bake for 20 minutes, then lower the oven setting to 180C, 350F, gas 4 and cook for another 15 mins. Allow to rest for 10-15 mins before slicing and serving with the side dishes of your choice. The beef should still be pink in the centre when you serve it."],"imgUrl":"https://www.themealdb.com/images/media/meals/vvpprx1487325699.jpg","tags":["Meat","Stew"]},{"title":"Baingan Bharta","category":"Vegetarian","region":"Indian","ingList":[{"ing":"Aubergine","amount":"1 large"},{"ing":"Onion","amount":"½ cup "},{"ing":"Tomatoes","amount":"1 cup"},{"ing":"Garlic","amount":"6 cloves"},{"ing":"Green Chili","amount":"1"},{"ing":"Red Chili Powder","amount":"¼ teaspoon"},{"ing":"Oil","amount":"1.5 tablespoon"},{"ing":"Coriander Leaves","amount":"1 tablespoon chopped"},{"ing":"salt","amount":"as required"}],"steps":["Rinse the baingan (eggplant or aubergine) in water. Pat dry with a kitchen napkin. Apply some oil all over and","keep it for roasting on an open flame. You can also grill the baingan or roast in the oven. But then you won't get","the smoky flavor of the baingan. Keep the eggplant turning after a 2 to 3 minutes on the flame, so that its evenly","cooked. You could also embed some garlic cloves in the baingan and then roast it.","2. Roast the aubergine till its completely cooked and tender. With a knife check the doneness. The knife should slid","easily in aubergines without any resistance. Remove the baingan and immerse in a bowl of water till it cools","down.","3. You can also do the dhungar technique of infusing charcoal smoky flavor in the baingan. This is an optional step.","Use natural charcoal for this method. Heat a small piece of charcoal on flame till it becomes smoking hot and red.","4. Make small cuts on the baingan with a knife. Place the red hot charcoal in the same plate where the roasted","aubergine is kept. Add a few drops of oil on the charcoal. The charcoal would begin to smoke.","5. As soon as smoke begins to release from the charcoal, cover the entire plate tightly with a large bowl. Allow the","charcoal smoke to get infused for 1 to 2 minutes. The more you do, the more smoky the baingan bharta will","become. I just keep for a minute. Alternatively, you can also do this dhungar method once the baingan bharta is","cooked, just like the way we do for Dal Tadka.","6. Peel the skin from the roasted and smoked eggplant.","7. Chop the cooked eggplant finely or you can even mash it.","8. In a kadai or pan, heat oil. Then add finely chopped onions and garlic.","9. Saute the onions till translucent. Don't brown them.","10. Add chopped green chilies and saute for a minute.","11. Add the chopped tomatoes and mix it well.","12. Bhuno (saute) the tomatoes till the oil starts separating from the mixture.","13. Now add the red chili powder. Stir and mix well.","14. Add the chopped cooked baingan.","15. Stir and mix the chopped baingan very well with the onion­tomato masala mixture.","16. Season with salt. Stir and saute for some more 4 to 5 minutes more.","17. Finally stir in the coriander leaves with the baingan bharta or garnish it with them. Serve Baingan Bharta with","phulkas, rotis or chapatis. It goes well even with bread, toasted or grilled bread and plain rice or jeera rice."],"imgUrl":"https://www.themealdb.com/images/media/meals/urtpqw1487341253.jpg","tags":["Spicy","Bun","Calorific"]},{"title":"Beef Brisket Pot Roast","category":"Beef","region":"American","ingList":[{"ing":"Beef Brisket","amount":"4-5 pound"},{"ing":"Salt","amount":"Dash"},{"ing":"Onion","amount":"3"},{"ing":"Garlic","amount":"5 cloves"},{"ing":"Thyme","amount":"1 Sprig"},{"ing":"Rosemary","amount":"1 sprig "},{"ing":"Bay Leaves","amount":"4"},{"ing":"beef stock","amount":"2 cups"},{"ing":"Carrots","amount":"3 Large"},{"ing":"Mustard","amount":"1 Tbsp"},{"ing":"Potatoes","amount":"4 Mashed"}],"steps":["1 Prepare the brisket for cooking: On one side of the brisket there should be a layer of fat, which you want. If there are any large chunks of fat, cut them off and discard them. Large pieces of fat will not be able to render out completely.","Using a sharp knife, score the fat in parallel lines, about 3/4-inch apart. Slice through the fat, not the beef. Repeat in the opposite direction to make a cross-hatch pattern.","Salt the brisket well and let it sit at room temperature for 30 minutes."," ","2 Sear the brisket: You'll need an oven-proof, thick-bottomed pot with a cover, or Dutch oven, that is just wide enough to hold the brisket roast with a little room for the onions.","Pat the brisket dry and place it, fatty side down, into the pot and place it on medium high heat. Cook for 5-8 minutes, lightly sizzling, until the fat side is nicely browned. (If the roast seems to be cooking too fast, turn the heat down to medium. You want a steady sizzle, not a raging sear.)","Turn the brisket over and cook for a few minutes more to brown the other side.","","3 Sauté the onions and garlic: When the brisket has browned, remove it from the pot and set aside. There should be a couple tablespoons of fat rendered in the pot, if not, add some olive oil.","Add the chopped onions and increase the heat to high. Sprinkle a little salt on the onions. Sauté, stirring often, until the onions are lightly browned, 5-8 minutes. Stir in the garlic and cook 1-2 more minutes."," ","4 Return brisket to pot, add herbs, stock, bring to simmer, cover, cook in oven: Preheat the oven to 300°F. Use kitchen twine to tie together the bay leaves, rosemary and thyme.","Move the onions and garlic to the sides of the pot and nestle the brisket inside. Add the beef stock and the tied-up herbs. Bring the stock to a boil on the stovetop.","Cover the pot, place the pot in the 300°F oven and cook for 3 hours. Carefully flip the brisket every hour so it cooks evenly."," ","5 Add carrots, continue to cook: After 3 hours, add the carrots. Cover the pot and cook for 1 hour more, or until the carrots are cooked through and the brisket is falling-apart tender.","6 Remove brisket to cutting board, tent with foil: When the brisket is falling-apart tender, take the pot out of the oven and remove the brisket to a cutting board. Cover it with foil. Pull out and discard the herbs.","7 Make sauce (optional): At this point you have two options. You can serve as is, or you can make a sauce with the drippings and some of the onions. If you serve as is, skip this step.","To make a sauce, remove the carrots and half of the onions, set aside and cover them with foil. Pour the ingredients that are remaining into the pot into a blender, and purée until smooth. If you want, add 1 tablespoon of mustard to the mix. Put into a small pot and keep warm.","8 Slice the meat across the grain: Notice the lines of the muscle fibers of the roast. This is the \"grain\" of the meat. Slice the meat perpendicular to these lines, or across the grain (cutting this way further tenderizes the meat), in 1/4-inch to 1/2-inch slices.","Serve with the onions, carrots and gravy. Serve with mashed, roasted or boiled potatoes, egg noodles or polenta."],"imgUrl":"https://www.themealdb.com/images/media/meals/ursuup1487348423.jpg","tags":["Meat"]},{"title":"Beef Sunday Roast","category":"Beef","region":"British","ingList":[{"ing":"Beef","amount":"8 slices"},{"ing":"Broccoli","amount":"12 florets"},{"ing":"Potatoes","amount":"1 Packet"},{"ing":"Carrots","amount":"1 Packet"},{"ing":"plain flour","amount":"140g"},{"ing":"Eggs","amount":"4"},{"ing":"milk","amount":"200ml"},{"ing":"sunflower oil","amount":"drizzle (for cooking)"}],"steps":["Cook the Broccoli and Carrots in a pan of boiling water until tender.","","Roast the Beef and Potatoes in the oven for 45mins, the potatoes may need to be checked regularly to not overcook.","","To make the Yorkshire puddings:","Heat oven to 230C/fan 210C/gas 8. Drizzle a little sunflower oil evenly into 2 x 4-hole Yorkshire pudding tins or a 12-hole non-stick muffin tin and place in the oven to heat through","To make the batter, tip 140g plain flour into a bowl and beat in four eggs until smooth. Gradually add 200ml milk and carry on beating until the mix is completely lump-free. Season with salt and pepper. Pour the batter into a jug, then remove the hot tins from the oven. Carefully and evenly pour the batter into the holes. Place the tins back in the oven and leave undisturbed for 20-25 mins until the puddings have puffed up and browned. Serve immediately.","","Plate up and add the Gravy as desired."],"imgUrl":"https://www.themealdb.com/images/media/meals/ssrrrs1503664277.jpg","tags":["MainMeal"]},{"title":"Braised Beef Chilli","category":"Beef","region":"Mexican","ingList":[{"ing":"Beef","amount":"1kg"},{"ing":"Onions","amount":"3"},{"ing":"Garlic","amount":"4 cloves"},{"ing":"Olive oil","amount":"Dash"},{"ing":"Chorizo","amount":"300g"},{"ing":"Cumin","amount":"2 tsp"},{"ing":"All spice","amount":"2 tsp"},{"ing":"Cloves","amount":"1 tsp"},{"ing":"Cinnamon stick","amount":"1 large"},{"ing":"Bay Leaves","amount":"3"},{"ing":"Oregano","amount":"2 tsp dried"},{"ing":"Ancho Chillies","amount":"2 ancho"},{"ing":"Balsamic Vinegar","amount":"3 tbsp"},{"ing":"Plum Tomatoes","amount":"2 x 400g"},{"ing":"Tomato Ketchup","amount":"2 tbsp"},{"ing":"Dark Brown Sugar","amount":"2 tbsp"},{"ing":"Borlotti Beans","amount":"2 x 400g tins"}],"steps":["Preheat the oven to 120C/225F/gas mark 1.","","Take the meat out of the fridge to de-chill. Pulse the onions and garlic in a food processor until finely chopped. Heat 2 tbsp olive oil in a large casserole and sear the meat on all sides until golden.","","Set to one side and add another small slug of oil to brown the chorizo. Remove and add the onion and garlic, spices, herbs and chillies then cook until soft in the chorizo oil. Season with salt and pepper and add the vinegar, tomatoes, ketchup and sugar.","","Put all the meat back into the pot with 400ml water (or red wine if you prefer), bring up to a simmer and cook, covered, in the low oven.","","After 2 hours, check the meat and add the beans. Cook for a further hour and just before serving, pull the meat apart with a pair of forks."],"imgUrl":"https://www.themealdb.com/images/media/meals/uuqvwu1504629254.jpg","tags":["Misc"]},{"title":"Beef stroganoff","category":"Beef","region":"Russian","ingList":[{"ing":"Olive Oil","amount":"1 tbls"},{"ing":"Onions","amount":"1"},{"ing":"Garlic","amount":"1 clove"},{"ing":"Butter","amount":"1 tbsp"},{"ing":"Mushrooms","amount":"250g"},{"ing":"Beef Fillet","amount":"500g"},{"ing":"Plain Flour","amount":"1tbsp"},{"ing":"Creme Fraiche","amount":"150g"},{"ing":"English Mustard","amount":"1 tbsp"},{"ing":"Beef Stock","amount":"100ml"},{"ing":"Parsley","amount":"Topping"}],"steps":["Heat the olive oil in a non-stick frying pan then add the sliced onion and cook on a medium heat until completely softened, so around 15 mins, adding a little splash of water if they start to stick at all. Crush in the garlic and cook for a 2-3 mins further, then add the butter. Once the butter is foaming a little, add the mushrooms and cook for around 5 mins until completely softened. Season everything well, then tip onto a plate.","Tip the flour into a bowl with a big pinch of salt and pepper, then toss the steak in the seasoned flour. Add the steak pieces to the pan, splashing in a little oil if the pan looks particularly dry, and fry for 3-4 mins, until well coloured. Tip the onions and mushrooms back into the pan. Whisk the crème fraîche, mustard and beef stock together, then pour into the pan. Cook over a medium heat for around 5 mins. Scatter with parsley, then serve with pappardelle or rice."],"imgUrl":"https://www.themealdb.com/images/media/meals/svprys1511176755.jpg","tags":["Misc"]},{"title":"Broccoli & Stilton soup","category":"Starter","region":"British","ingList":[{"ing":"Rapeseed Oil","amount":"2 tblsp "},{"ing":"Onion","amount":"1 finely chopped "},{"ing":"Celery","amount":"1"},{"ing":"Leek","amount":"1 sliced"},{"ing":"Potatoes","amount":"1 medium"},{"ing":"Butter","amount":"1 knob"},{"ing":"Vegetable Stock","amount":"1 litre hot"},{"ing":"Broccoli","amount":"1 Head chopped"},{"ing":"Stilton Cheese","amount":"140g"}],"steps":["Heat the rapeseed oil in a large saucepan and then add the onions. Cook on a medium heat until soft. Add a splash of water if the onions start to catch.","","Add the celery, leek, potato and a knob of butter. Stir until melted, then cover with a lid. Allow to sweat for 5 minutes. Remove the lid.","","Pour in the stock and add any chunky bits of broccoli stalk. Cook for 10 – 15 minutes until all the vegetables are soft.","","Add the rest of the broccoli and cook for a further 5 minutes. Carefully transfer to a blender and blitz until smooth. Stir in the stilton, allowing a few lumps to remain. Season with black pepper and serve."],"imgUrl":"https://www.themealdb.com/images/media/meals/tvvxpv1511191952.jpg","tags":["Misc"]},{"title":"Bean & Sausage Hotpot","category":"Miscellaneous","region":"British","ingList":[{"ing":"Sausages","amount":"8 large"},{"ing":"Tomato Sauce","amount":"1 Jar"},{"ing":"Butter Beans","amount":"1200g"},{"ing":"Black Treacle","amount":"1 tbls"},{"ing":"English Mustard","amount":"1 tsp "}],"steps":["In a large casserole, fry the sausages until brown all over – about 10 mins.","","Add the tomato sauce, stirring well, then stir in the beans, treacle or sugar and mustard. Bring to the simmer, cover and cook for 30 mins. Great served with crusty bread or rice."],"imgUrl":"https://www.themealdb.com/images/media/meals/vxuyrx1511302687.jpg","tags":["Misc"]},{"title":"Banana Pancakes","category":"Dessert","region":"American","ingList":[{"ing":"Banana","amount":"1 large"},{"ing":"Eggs","amount":"2 medium"},{"ing":"Baking Powder","amount":"pinch"},{"ing":"Vanilla Extract","amount":"spinkling"},{"ing":"Oil","amount":"1 tsp "},{"ing":"Pecan Nuts","amount":"25g"},{"ing":"Raspberries","amount":"125g"}],"steps":["In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.","Heat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries."],"imgUrl":"https://www.themealdb.com/images/media/meals/sywswr1511383814.jpg","tags":["Breakfast","Desert","Sweet"]},{"title":"Beef Dumpling Stew","category":"Beef","region":"British","ingList":[{"ing":"Olive Oil","amount":"2 tbs"},{"ing":"Butter","amount":"25g"},{"ing":"Beef","amount":"750g"},{"ing":"Plain Flour","amount":"2 tblsp "},{"ing":"Garlic","amount":"2 cloves minced"},{"ing":"Onions","amount":"175g"},{"ing":"Celery","amount":"150g"},{"ing":"Carrots","amount":"150g"},{"ing":"Leek","amount":"2 chopped"},{"ing":"Swede","amount":"200g"},{"ing":"Red Wine","amount":"150ml"},{"ing":"Beef Stock","amount":"500g"},{"ing":"Bay Leaf","amount":"2"},{"ing":"Thyme","amount":"3 tbs"},{"ing":"Parsley","amount":"3 tblsp chopped"},{"ing":"Plain Flour","amount":"125g"},{"ing":"Baking Powder","amount":"1 tsp "},{"ing":"Suet","amount":"60g"},{"ing":"Water","amount":"Splash"}],"steps":["Preheat the oven to 180C/350F/Gas 4.","","For the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.","","Sprinkle over the flour and cook for a further 2-3 minutes.","","Add the garlic and all the vegetables and fry for 1-2 minutes.","","Stir in the wine, stock and herbs, then add the Worcestershire sauce and balsamic vinegar, to taste. Season with salt and freshly ground black pepper.","","Cover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.","","For the dumplings, sift the flour, baking powder and salt into a bowl.","Add the suet and enough water to form a thick dough.","","With floured hands, roll spoonfuls of the dough into small balls.","","After two hours, remove the lid from the stew and place the balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)","","To serve, place a spoonful of mashed potato onto each of four serving plates and top with the stew and dumplings. Sprinkle with chopped parsley."],"imgUrl":"https://www.themealdb.com/images/media/meals/uyqrrv1511553350.jpg","tags":["Stew","Baking"]},{"title":"Beef and Mustard Pie","category":"Beef","region":"British","ingList":[{"ing":"Beef","amount":"1kg"},{"ing":"Plain Flour","amount":"2 tbs"},{"ing":"Rapeseed Oil","amount":"2 tbs"},{"ing":"Red Wine","amount":"200ml"},{"ing":"Beef Stock","amount":"400ml"},{"ing":"Onion","amount":"1 finely sliced"},{"ing":"Carrots","amount":"2 chopped"},{"ing":"Thyme","amount":"3 sprigs"},{"ing":"Mustard","amount":"2 tbs"},{"ing":"Egg Yolks","amount":"2 free-range"},{"ing":"Puff Pastry","amount":"400g"},{"ing":"Green Beans","amount":"300g"},{"ing":"Butter","amount":"25g"},{"ing":"Salt","amount":"pinch"},{"ing":"Pepper","amount":"pinch"}],"steps":["Preheat the oven to 150C/300F/Gas 2.","Toss the beef and flour together in a bowl with some salt and black pepper.","Heat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.","Fry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.","Return the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.","Cover with a lid and place in the oven for two hours.","Remove from the oven, check the seasoning and set aside to cool. Remove the thyme.","When the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.","Transfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.","Trim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.","For the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.","Drain and toss with the butter, then season with black pepper.","To serve, place a large spoonful of pie onto each plate with some green beans alongside."],"imgUrl":"https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg","tags":["Meat","Pie"]},{"title":"Beef and Oyster pie","category":"Beef","region":"British","ingList":[{"ing":"Beef","amount":"900g"},{"ing":"Olive Oil","amount":"3 tbs"},{"ing":"Shallots","amount":"3"},{"ing":"Garlic","amount":"2 cloves minced"},{"ing":"Bacon","amount":"125g"},{"ing":"Thyme","amount":"1 tbs chopped"},{"ing":"Bay Leaf","amount":"2"},{"ing":"Stout","amount":"330ml"},{"ing":"Beef Stock","amount":"400ml"},{"ing":"Corn Flour","amount":"2 tbs"},{"ing":"Oysters","amount":"8"},{"ing":"Plain Flour","amount":"400g"},{"ing":"Salt","amount":"pinch"},{"ing":"Butter","amount":"250g"},{"ing":"Eggs","amount":"To Glaze"}],"steps":["Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.","In the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.","Preheat the oven to 180C/350F/Gas 4.","Pour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.","Skim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.","Increase the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.","Roll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.","Roll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling."],"imgUrl":"https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg","tags":["Pie"]},{"title":"Blackberry Fool","category":"Dessert","region":"British","ingList":[{"ing":"Hazlenuts","amount":"50g"},{"ing":"Butter","amount":"125g"},{"ing":"Caster Sugar","amount":"150g"},{"ing":"Lemon","amount":"Grated"},{"ing":"Plain Flour","amount":"150g"},{"ing":"Baking Powder","amount":"½ tsp"},{"ing":"Blackberrys","amount":"600g"},{"ing":"Sugar","amount":"75g"},{"ing":"Caster Sugar","amount":"2 tbs"},{"ing":"Lemon Juice","amount":"1 tbs"},{"ing":"Double Cream","amount":"300ml "},{"ing":"Yogurt","amount":"100ml"},{"ing":"Mint","amount":"Garnish with"}],"steps":["For the biscuits, preheat the oven to 200C/180C (fan)/Gas 6 and line two large baking trays with baking parchment. Scatter the nuts over a baking tray and roast in the oven for 6-8 minutes, or until golden-brown. Watch them carefully so that they don’t have a chance to burn. Remove from the oven, tip onto a board and leave to cool.","Put the butter and sugar in a large bowl and beat with a wooden spoon until light and creamy. Roughly chop the cooled nuts and add to the creamed butter and sugar, along with the lemon zest, flour and baking powder. Stir well until the mixture comes together and forms a ball – you may need to use your hands.","Divide the biscuit dough into 24 even pieces and roll into small balls. Place the balls the prepared baking trays, spaced well apart to allow for spreading.","Press the biscuits to flatten to around 1cm/½in thick. Bake the biscuits, one tray at a time, for 12 minutes or until very pale golden-brown. Leave to cool on the trays. They will be very soft when you take them out of the oven, but will crisp as they cool.","Store in an airtight tin and eat within five days.","For the fool, rinse the blackberries in a colander to wash away any dust or dirt. Put the blackberries in a non-stick saucepan and sprinkle over the caster sugar.","Stir in the lemon juice and heat gently for two minutes, or until the blackberries begin to soften and release their juices. Remove and reserve 12 blackberries for decoration and continue cooking the rest.","Simmer the blackberries very gently for 15 minutes, stirring regularly until very soft and squidgy. Remove from the heat and press the berries and juice through a sieve over a bowl, using the bottom of a ladle to help you extract as much of the purée as possible. Leave the purée to cool and discard the seeds. You should end up with around 325ml/11fl oz of purée.","Put the cream and yoghurt in a large bowl and whip with an electric whisk until soft peaks form when the whisk is removed from the bowl – the acidity of the fruit will thicken the cream further, so don’t take it too far.","When the purée is completely cold, adjust the sweetness to taste by adding more sugar if needed. Pour it into the bowl with the whipped cream and yoghurt and stir just once or twice until very lightly combined.","Spoon the blackberry fool into individual wide, glass dishes – or one large, single bowl. It should look quite marbled, so don’t over-stir it. Scatter a few tiny mint leaves on top and decorate with the reserved blackberries. Sprinkle with a little sugar if you like and serve with the hazelnut biscuits."],"imgUrl":"https://www.themealdb.com/images/media/meals/rpvptu1511641092.jpg","tags":["Desert","Summer","Fruity","Dairy"]},{"title":"Battenberg Cake","category":"Dessert","region":"British","ingList":[{"ing":"Butter","amount":"175g"},{"ing":"Caster Sugar","amount":"175g"},{"ing":"Self-raising Flour","amount":"140g"},{"ing":"Almonds","amount":"50g"},{"ing":"Baking Powder","amount":"½ tsp"},{"ing":"Eggs","amount":"3 Medium"},{"ing":"Vanilla Extract","amount":"½ tsp"},{"ing":"Almond Extract","amount":"¼ teaspoon"},{"ing":"Butter","amount":"175g"},{"ing":"Caster Sugar","amount":"175g"},{"ing":"Self-raising Flour","amount":"140g"},{"ing":"Almonds","amount":"50g"},{"ing":"Baking Powder","amount":"½ tsp"},{"ing":"Eggs","amount":"3 Medium"},{"ing":"Vanilla Extract","amount":"½ tsp"},{"ing":"Almond Extract","amount":"¼ teaspoon"},{"ing":"Pink Food Colouring","amount":"½ tsp"},{"ing":"Apricot","amount":"200g"},{"ing":"Marzipan","amount":"1kg"},{"ing":"Icing Sugar","amount":"Dusting"}],"steps":["Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.","For the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.","To assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.","Take 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.","Carefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.","Assemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month."],"imgUrl":"https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg","tags":["Cake","Sweet"]},{"title":"Beef Bourguignon","category":"Beef","region":"French","ingList":[{"ing":"Goose Fat","amount":"3 tsp"},{"ing":"Beef Shin","amount":"600g"},{"ing":"Bacon","amount":"100g "},{"ing":"Challots","amount":"350g"},{"ing":"Chestnut Mushroom","amount":"250g"},{"ing":"Garlic Clove","amount":"2 sliced"},{"ing":"Bouquet Garni","amount":"1"},{"ing":"Tomato Puree","amount":"1 tbs"},{"ing":"Red Wine","amount":"750 ml "},{"ing":"Celeriac","amount":"600g"},{"ing":"Olive Oil","amount":"2 tbs"},{"ing":"Thyme","amount":"sprigs of fresh"},{"ing":"Rosemary","amount":"sprigs of fresh"},{"ing":"Bay Leaf","amount":"2"},{"ing":"Cardamom","amount":"4"}],"steps":["Heat a large casserole pan and add 1 tbsp goose fat. Season the beef and fry until golden brown, about 3-5 mins, then turn over and fry the other side until the meat is browned all over, adding more fat if necessary. Do this in 2-3 batches, transferring the meat to a colander set over a bowl when browned.","In the same pan, fry the bacon, shallots or pearl onions, mushrooms, garlic and bouquet garni until lightly browned. Mix in the tomato purée and cook for a few mins, stirring into the mixture. This enriches the bourguignon and makes a great base for the stew. Then return the beef and any drained juices to the pan and stir through.","Pour over the wine and about 100ml water so the meat bobs up from the liquid, but isn’t completely covered. Bring to the boil and use a spoon to scrape the caramelised cooking juices from the bottom of the pan – this will give the stew more flavour.","Heat oven to 150C/fan 130C/gas 2. Make a cartouche: tear off a square of foil slightly larger than the casserole, arrange it in the pan so it covers the top of the stew and trim away any excess foil. Then cook for 3 hrs. If the sauce looks watery, remove the beef and veg with a slotted spoon, and set aside. Cook the sauce over a high heat for a few mins until the sauce has thickened a little, then return the beef and vegetables to the pan.","To make the celeriac mash, peel the celeriac and cut into cubes. Heat the olive oil in a large frying pan. Tip in the celeriac and fry for 5 mins until it turns golden. Season well with salt and pepper. Stir in the rosemary, thyme, bay and cardamom pods, then pour over 200ml water, enough to nearly cover the celeriac. Turn the heat to low, partially cover the pan and leave to simmer for 25-30 mins.","After 25-30 mins, the celeriac should be soft and most of the water will have evaporated. Drain away any remaining water, then remove the herb sprigs, bay and cardamom pods. Lightly crush with a potato masher, then finish with a glug of olive oil and season to taste. Spoon the beef bourguignon into serving bowls and place a large spoonful of the celeriac mash on top. Garnish with one of the bay leaves, if you like."],"imgUrl":"https://www.themealdb.com/images/media/meals/vtqxtu1511784197.jpg","tags":["Misc"]},{"title":"Brie wrapped in prosciutto & brioche","category":"Side","region":"French","ingList":[{"ing":"Plain Flour","amount":"375g"},{"ing":"Caster Sugar","amount":"50g"},{"ing":"Yeast","amount":"7g"},{"ing":"Milk","amount":"75g"},{"ing":"Eggs","amount":"3 Large"},{"ing":"Eggs","amount":"To Glaze"},{"ing":"Butter","amount":"180g"},{"ing":"Brie","amount":"250g"},{"ing":"Prosciutto","amount":"8 slices"}],"steps":["Mix the flour, 1 tsp salt, caster sugar, yeast, milk and eggs together in a mixer using the dough attachment for 5 mins until the dough is smooth. Add the butter and mix for a further 4 mins on medium speed. Scrape the dough bowl and mix again for 1 min. Place the dough in a container, cover with cling film and leave in the fridge for at least 6 hrs before using.","Wrap the Brie in the prosciutto and set aside. Turn out the dough onto a lightly floured surface. Roll into a 25cm circle. Place the wrapped Brie in the middle of the circle and fold the edges in neatly. Put the parcel onto a baking tray lined with baking parchment and brush with beaten egg. Chill in the fridge for 30 mins, then brush again with beaten egg and chill for a further 30 mins. Leave to rise for 1 hr at room temperature. Heat oven to 200C/180C fan/gas 6, then bake for 22 mins. Serve warm."],"imgUrl":"https://www.themealdb.com/images/media/meals/qqpwsy1511796276.jpg","tags":["SideDish","Treat","Baking"]},{"title":"Boulangère Potatoes","category":"Side","region":"French","ingList":[{"ing":"Onions","amount":"2 finely chopped"},{"ing":"Thyme","amount":"sprigs of fresh"},{"ing":"Olive Oil","amount":"2 tbs"},{"ing":"Potatoes","amount":"1.5kg"},{"ing":"Vegetable Stock","amount":"425g"}],"steps":["Heat oven to 200C/fan 180C/gas 6. Fry the onions and thyme sprigs in the oil until softened and lightly coloured (about 5 mins).","Spread a layer of potatoes over the base of a 1.5-litre oiled gratin dish. Sprinkle over a few onions (see picture, above) and continue layering, finishing with a layer of potatoes. Pour over the stock and bake for 50-60 mins until the potatoes are cooked and the top is golden and crisp."],"imgUrl":"https://www.themealdb.com/images/media/meals/qywups1511796761.jpg","tags":["SideDish"]},{"title":"BeaverTails","category":"Dessert","region":"Canadian","ingList":[{"ing":"Water","amount":"1/2 cup "},{"ing":"Yeast","amount":"2 parts "},{"ing":"Sugar","amount":"1/2 cup "},{"ing":"Milk","amount":"1/2 cup "},{"ing":"Butter","amount":"6 tblsp"},{"ing":"Eggs","amount":"2"},{"ing":"Salt","amount":"1 ½ tsp"},{"ing":"Flour","amount":"2-1/2 cups"},{"ing":"Oil","amount":"for frying"},{"ing":"Lemon","amount":"garnish"},{"ing":"Sugar","amount":"garnish"},{"ing":"Cinnamon","amount":"garnish"}],"steps":["In the bowl of a stand mixer, add warm water, a big pinch of sugar and yeast. Allow to sit until frothy.","Into the same bowl, add 1/2 cup sugar, warm milk, melted butter, eggs and salt, and whisk until combined.","Place a dough hook on the mixer, add the flour with the machine on, until a smooth but slightly sticky dough forms.","Place dough in a bowl, cover with plastic wrap, and allow to proof for 1 1/2 hours.","Cut dough into 12 pieces, and roll out into long oval-like shapes about 1/4 inch thick that resemble a beaver’s tail.","In a large, deep pot, heat oil to 350 degrees. Gently place beavertail dough into hot oil and cook for 30 to 45 seconds on each side until golden brown.","Drain on paper towels, and garnish as desired. Toss in cinnamon sugar, in white sugar with a squeeze of lemon, or with a generous slathering of Nutella and a handful of toasted almonds. Enjoy!"],"imgUrl":"https://www.themealdb.com/images/media/meals/ryppsv1511815505.jpg","tags":["Treat","Pudding","Speciality"]},{"title":"Brown Stew Chicken","category":"Chicken","region":"Jamaican","ingList":[{"ing":"Chicken","amount":"1 whole"},{"ing":"Tomato","amount":"1 chopped"},{"ing":"Onions","amount":"2 chopped"},{"ing":"Garlic Clove","amount":"2 chopped"},{"ing":"Red Pepper","amount":"1 chopped"},{"ing":"Carrots","amount":"1 chopped"},{"ing":"Lime","amount":"1"},{"ing":"Thyme","amount":"2 tsp"},{"ing":"Allspice","amount":"1 tsp "},{"ing":"Soy Sauce","amount":"2 tbs"},{"ing":"Cornstarch","amount":"2 tsp"},{"ing":"Coconut Milk","amount":"2 cups "},{"ing":"Vegetable Oil","amount":"1 tbs"}],"steps":["Squeeze lime over chicken and rub well. Drain off excess lime juice.","Combine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.","Heat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.","Lightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.","Drain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.","Mix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender."],"imgUrl":"https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg","tags":["Stew"]},{"title":"Beef Lo Mein","category":"Beef","region":"Chinese","ingList":[{"ing":"Beef","amount":"1/2 lb"},{"ing":"Salt","amount":"pinch"},{"ing":"Pepper","amount":"pinch"},{"ing":"Sesame Seed Oil","amount":"2 tsp"},{"ing":"Egg","amount":"1/2 "},{"ing":"Starch","amount":"3 tbs"},{"ing":"Oil","amount":"5 tbs"},{"ing":"Noodles","amount":"1/4 lb"},{"ing":"Onion","amount":"1/2 cup "},{"ing":"Minced Garlic","amount":"1 tsp "},{"ing":"Ginger","amount":"1 tsp "},{"ing":"Bean Sprouts","amount":"1 cup "},{"ing":"Mushrooms","amount":"1 cup "},{"ing":"Water","amount":"1 cup "},{"ing":"Oyster Sauce","amount":"1 tbs"},{"ing":"Sugar","amount":"1 tsp "},{"ing":"Soy Sauce","amount":"1 tsp "}],"steps":["STEP 1 - MARINATING THE BEEF","In a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.","STEP 2 - BOILING THE THE NOODLES","In a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.","STEP 3 - STIR FRY","Add 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked.","Set the cooked beef aside","In a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water.","Add the noodles to wok","To make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce.","Next add the beef to wok and stir-fry"],"imgUrl":"https://www.themealdb.com/images/media/meals/1529444830.jpg","tags":["Misc"]},{"title":"Baked salmon with fennel & tomatoes","category":"Seafood","region":"British","ingList":[{"ing":"Fennel","amount":"2 medium"},{"ing":"Parsley","amount":"2 tbs chopped"},{"ing":"Lemon","amount":"Juice of 1"},{"ing":"Cherry Tomatoes","amount":"175g"},{"ing":"Olive Oil","amount":"1 tbs"},{"ing":"Salmon","amount":"350g"},{"ing":"Black Olives","amount":"to serve"}],"steps":["Heat oven to 180C/fan 160C/gas 4. Trim the fronds from the fennel and set aside. Cut the fennel bulbs in half, then cut each half into 3 wedges. Cook in boiling salted water for 10 mins, then drain well. Chop the fennel fronds roughly, then mix with the parsley and lemon zest.","","Spread the drained fennel over a shallow ovenproof dish, then add the tomatoes. Drizzle with olive oil, then bake for 10 mins. Nestle the salmon among the veg, sprinkle with lemon juice, then bake 15 mins more until the fish is just cooked. Scatter over the parsley and serve."],"imgUrl":"https://www.themealdb.com/images/media/meals/1548772327.jpg","tags":["Paleo","Keto","HighFat","Baking","LowCarbs"]},{"title":"Budino Di Ricotta","category":"Dessert","region":"Italian","ingList":[{"ing":"Ricotta","amount":"500g"},{"ing":"Eggs","amount":"4 large"},{"ing":"Flour","amount":"3 tbs"},{"ing":"Sugar","amount":"250g"},{"ing":"Cinnamon","amount":"1 tsp "},{"ing":"Lemons","amount":"Grated Zest of 2"},{"ing":"Dark Rum","amount":"5 tbs"},{"ing":"Icing Sugar","amount":"sprinking"}],"steps":["Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon rind and the rum and mix well. You can do this in a food processor. Beat the egg whites until stiff, fold in and pour into a buttered and floured 25cm cake tin. Bake in the oven at 180ºC/160ºC fan/gas 4 for about 40 minutes, or until it is firm.","","Serve hot or cold dusted with icing sugar."],"imgUrl":"https://www.themealdb.com/images/media/meals/1549542877.jpg","tags":["Cake","Baking","Desert","Sweet","Alcoholic","Calorific"]},{"title":"Breakfast Potatoes","category":"Breakfast","region":"Canadian","ingList":[{"ing":"Potatoes","amount":"3 Medium"},{"ing":"Olive Oil","amount":"1 tbs"},{"ing":"Bacon","amount":"2 strips"},{"ing":"Garlic Clove","amount":"Minced"},{"ing":"Maple Syrup","amount":"1 tbs"},{"ing":"Parsley","amount":"Garnish"},{"ing":"Salt","amount":"Pinch"},{"ing":"Pepper","amount":"Pinch"},{"ing":"Allspice","amount":"To taste"}],"steps":["Before you do anything, freeze your bacon slices that way when you're ready to prep, it'll be so much easier to chop!","Wash the potatoes and cut medium dice into square pieces. To prevent any browning, place the already cut potatoes in a bowl filled with water.","In the meantime, heat 1-2 tablespoons of oil in a large skillet over medium-high heat. Tilt the skillet so the oil spreads evenly.","Once the oil is hot, drain the potatoes and add to the skillet. Season with salt, pepper, and Old Bay as needed.","Cook for 10 minutes, stirring the potatoes often, until brown. If needed, add a tablespoon more of oil.","Chop up the bacon and add to the potatoes. The bacon will start to render and the fat will begin to further cook the potatoes. Toss it up a bit! The bacon will take 5-6 minutes to crisp.","Once the bacon is cooked, reduce the heat to medium-low, add the minced garlic and toss. Season once more. Add dried or fresh parsley. Control heat as needed.","Let the garlic cook until fragrant, about one minute.","Just before serving, drizzle over the maple syrup and toss. Let that cook another minute, giving the potatoes a caramelized effect.","Serve in a warm bowl with a sunny side up egg!"],"imgUrl":"https://www.themealdb.com/images/media/meals/1550441882.jpg","tags":["Breakfast","Brunch",""]},{"title":"Bitterballen (Dutch meatballs)","category":"Beef","region":"Dutch","ingList":[{"ing":"Butter","amount":"100g "},{"ing":"Flour","amount":"150g"},{"ing":"Beef Stock","amount":"700ml"},{"ing":"Onion","amount":"30g"},{"ing":"Parsley","amount":"1 tbs"},{"ing":"Beef","amount":"400g"},{"ing":"Salt","amount":"Pinch"},{"ing":"Pepper","amount":"Pinch"},{"ing":"Nutmeg","amount":"Pinch"},{"ing":"Flour","amount":"50g"},{"ing":"Eggs","amount":"2 Beaten "},{"ing":"Breadcrumbs","amount":"50g"}],"steps":["Melt the butter in a skillet or pan. When melted, add the flour little by little and stir into a thick paste. Slowly stir in the stock, making sure the roux absorbs the liquid. Simmer for a couple of minutes on a low heat while you stir in the onion, parsley and the shredded meat. The mixture should thicken and turn into a heavy, thick sauce.","","Pour the mixture into a shallow container, cover and refrigerate for several hours, or until the sauce has solidified.","","Take a heaping tablespoon of the cold, thick sauce and quickly roll it into a small ball. Roll lightly through the flour, then the egg and finally the breadcrumbs. Make sure that the egg covers the whole surface of the bitterbal. When done, refrigerate the snacks while the oil in your fryer heats up to 190C (375F). Fry four bitterballen at a time, until golden.","","Serve on a plate with a nice grainy or spicy mustard. ",""],"imgUrl":"https://www.themealdb.com/images/media/meals/lhqev81565090111.jpg","tags":["DinnerParty","HangoverFood","Alcoholic"]},{"title":"BBQ Pork Sloppy Joes","category":"Pork","region":"American","ingList":[{"ing":"Potatoes","amount":"2"},{"ing":"Red Onions","amount":"1"},{"ing":"Garlic","amount":"2 cloves"},{"ing":"Lime","amount":"1"},{"ing":"Bread","amount":"2"},{"ing":"Pork","amount":"1 lb"},{"ing":"Barbeque Sauce","amount":" "},{"ing":"Hotsauce","amount":" "},{"ing":"Tomato Ketchup","amount":" "},{"ing":"Sugar","amount":" "},{"ing":"Vegetable Oil","amount":" "},{"ing":"Salt","amount":" "},{"ing":"Pepper","amount":" "}],"steps":["1","","Preheat oven to 450 degrees. Wash and dry all produce. Cut sweet potatoes into ½-inch-thick wedges. Toss on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 20-25 minutes.","","2","","Meanwhile, halve and peel onion. Slice as thinly as possible until you have ¼ cup (½ cup for 4 servings); finely chop remaining onion. Peel and finely chop garlic. Halve lime; squeeze juice into a small bowl. Halve buns. Add 1 TBSP butter (2 TBSP for 4) to a separate small microwave-safe bowl; microwave until melted, 30 seconds. Brush onto cut sides of buns.","","3","","To bowl with lime juice, add sliced onion, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. Stir to combine; set aside to quick-pickle.","","4","","Heat a drizzle of oil in a large pan over medium-high heat. Add chopped onion and season with salt and pepper. Cook, stirring, until softened, 4-5 minutes. Add garlic and cook until fragrant, 30 seconds more. Add pork and season with salt and pepper. Cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes.","","5","","While pork cooks, in a third small bowl, combine BBQ sauce, pickling liquid from onion, 3 TBSP ketchup (6 TBSP for 4 servings), ½ tsp sugar (1 tsp for 4), and ¼ cup water (⅓ cup for 4). Once pork is cooked through, add BBQ sauce mixture to pan. Cook, stirring, until sauce is thickened, 2-3 minutes. Taste and season with salt and pepper.","","6","","Meanwhile, toast buns in oven or toaster oven until golden, 3-5 minutes. Divide toasted buns between plates and fill with as much BBQ pork as you’d like. Top with pickled onion and hot sauce. Serve with sweet potato wedges on the side."],"imgUrl":"https://www.themealdb.com/images/media/meals/atd5sh1583188467.jpg","tags":["Misc"]},{"title":"Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber","category":"Beef","region":"Vietnamese","ingList":[{"ing":"Rice","amount":"White"},{"ing":"Onion","amount":"1"},{"ing":"Lime","amount":"1"},{"ing":"Garlic Clove","amount":"3"},{"ing":"Cucumber","amount":"1"},{"ing":"Carrots","amount":"3 oz "},{"ing":"Ground Beef","amount":"1 lb"},{"ing":"Soy Sauce","amount":"2 oz "}],"steps":["Add'l ingredients: mayonnaise, siracha","","1","","Place rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.","","2","","Meanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.","","3","","In a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.","","4","","Heat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.","","5","","Fluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo."],"imgUrl":"https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg","tags":["Misc"]},{"title":"Big Mac","category":"Beef","region":"American","ingList":[{"ing":"Minced Beef","amount":"400g"},{"ing":"Olive Oil","amount":"2 tbs"},{"ing":"Sesame Seed Burger Buns","amount":"2"},{"ing":"Onion","amount":"Chopped"},{"ing":"Iceberg Lettuce","amount":"1/4 "},{"ing":"Cheese","amount":"2 sliced"},{"ing":"Dill Pickles","amount":"2 large"},{"ing":"Mayonnaise","amount":"1 cup "},{"ing":"White Wine Vinegar","amount":"2 tsp"},{"ing":"Pepper","amount":"Pinch"},{"ing":"Mustard","amount":"2 tsp"},{"ing":"Onion Salt","amount":"1 1/2 tsp "},{"ing":"Garlic Powder","amount":"1 1/2 tsp "},{"ing":"Paprika","amount":"1/2 tsp"}],"steps":["For the Big Mac sauce, combine all the ingredients in a bowl, season with salt and chill until ready to use.","2. To make the patties, season the mince with salt and pepper and form into 4 balls using about 1/3 cup mince each. Place each onto a square of baking paper and flatten to form into four x 15cm circles. Heat oil in a large frypan over high heat. In 2 batches, cook beef patties for 1-2 minutes each side until lightly charred and cooked through. Remove from heat and keep warm. Repeat with remaining two patties.","3. Carefully slice each burger bun into three acrossways, then lightly toast.","4. To assemble the burgers, spread a little Big Mac sauce over the bottom base. Top with some chopped onion, shredded lettuce, slice of cheese, beef patty and some pickle slices. Top with the middle bun layer, and spread with more Big Mac sauce, onion, lettuce, pickles, beef patty and then finish with more sauce. Top with burger lid to serve.","5. After waiting half an hour for your food to settle, go for a jog."],"imgUrl":"https://www.themealdb.com/images/media/meals/urzj1d1587670726.jpg","tags":["Misc"]},{"title":"Bigos (Hunters Stew)","category":"Pork","region":"Polish","ingList":[{"ing":"Bacon","amount":"2 sliced"},{"ing":"Kielbasa","amount":"1 lb"},{"ing":"Pork","amount":"1 lb"},{"ing":"Flour","amount":"1/4 cup"},{"ing":"Garlic","amount":"3 chopped"},{"ing":"Onion","amount":"1 Diced"},{"ing":"Mushrooms","amount":"1 1/2 cup "},{"ing":"Cabbage","amount":"4 cups "},{"ing":"Sauerkraut","amount":"1 Jar"},{"ing":"Red Wine","amount":"1/4 cup"},{"ing":"Bay Leaf","amount":"1"},{"ing":"Basil","amount":"1 tsp "},{"ing":"Marjoram","amount":"1 tsp "},{"ing":"Paprika","amount":"1 tbs"},{"ing":"Caraway Seed","amount":"1/8 teaspoon"},{"ing":"Hotsauce","amount":"1 dash"},{"ing":"Beef Stock","amount":"5 Cups"},{"ing":"Tomato Puree","amount":"2 tbs"},{"ing":"Diced Tomatoes","amount":"1 cup "},{"ing":"Worcestershire Sauce","amount":"1 dash"}],"steps":["Preheat the oven to 350 degrees F (175 degrees C).","","Heat a large pot over medium heat. Add the bacon and kielbasa; cook and stir until the bacon has rendered its fat and sausage is lightly browned. Use a slotted spoon to remove the meat and transfer to a large casserole or Dutch oven.","","Coat the cubes of pork lightly with flour and fry them in the bacon drippings over medium-high heat until golden brown. Use a slotted spoon to transfer the pork to the casserole. Add the garlic, onion, carrots, fresh mushrooms, cabbage and sauerkraut. Reduce heat to medium; cook and stir until the carrots are soft, about 10 minutes. Do not let the vegetables brown.","","Deglaze the pan by pouring in the red wine and stirring to loosen all of the bits of food and flour that are stuck to the bottom. Season with the bay leaf, basil, marjoram, paprika, salt, pepper, caraway seeds and cayenne pepper; cook for 1 minute.","","Mix in the dried mushrooms, hot pepper sauce, Worcestershire sauce, beef stock, tomato paste and tomatoes. Heat through just until boiling. Pour the vegetables and all of the liquid into the casserole dish with the meat. Cover with a lid.","","Bake in the preheated oven for 2 1/2 to 3 hours, until meat is very tender."],"imgUrl":"https://www.themealdb.com/images/media/meals/md8w601593348504.jpg","tags":["Misc"]},{"title":"Boxty Breakfast","category":"Pork","region":"Irish","ingList":[{"ing":"Potatoes","amount":"4 large"},{"ing":"Spring Onions","amount":"1  bunch"},{"ing":"Plain Flour","amount":"100g "},{"ing":"Egg White","amount":"1"},{"ing":"Milk","amount":"150ml"},{"ing":"Bicarbonate Of Soda","amount":"1 tsp "},{"ing":"Butter","amount":"3 tbs"},{"ing":"Vegetable Oil","amount":"2 tbs"},{"ing":"Cherry Tomatoes","amount":"6"},{"ing":"Bacon","amount":"12"},{"ing":"Egg","amount":"6"}],"steps":["STEP 1","Before you start, put your oven on its lowest setting, ready to keep things warm. Peel the potatoes, grate 2 of them, then set aside. Cut the other 2 into large chunks, then boil for 10-15 mins or until tender. Meanwhile, squeeze as much of the liquid from the grated potatoes as you can using a clean tea towel. Mash the boiled potatoes, then mix with the grated potato, spring onions and flour.","","STEP 2","Whisk the egg white in a large bowl until it holds soft peaks. Fold in the buttermilk, then add the bicarbonate of soda. Fold into the potato mix.","","STEP 3","Heat a large non-stick frying pan over a medium heat, then add 1 tbsp butter and some of the oil. Drop 3-4 spoonfuls of the potato mixture into the pan, then gently cook for 3-5 mins on each side until golden and crusty. Keep warm on a plate in the oven while you cook the next batch, adding more butter and oil to the pan before you do so. You will get 16 crumpet-size boxty from the mix. Can be made the day ahead, drained on kitchen paper, then reheated in a low oven for 20 mins.","","STEP 4","Heat the grill to medium and put the tomatoes in a heavy-based pan. Add a good knob of butter and a little oil, then fry for about 5 mins until softened. Grill the bacon, then pile onto a plate and keep warm. Stack up the boxty, bacon and egg, and serve the tomatoes on the side."],"imgUrl":"https://www.themealdb.com/images/media/meals/naqyel1608588563.jpg","tags":["Misc"]},{"title":"Beef Rendang","category":"Beef","region":"Malaysian","ingList":[{"ing":"Beef","amount":"1lb"},{"ing":"Vegetable Oil","amount":"5 tbs"},{"ing":"Cinnamon Stick","amount":"1"},{"ing":"Cloves","amount":"3"},{"ing":"Star Anise","amount":"3"},{"ing":"Cardamom","amount":"3"},{"ing":"Coconut Cream","amount":"1 cup "},{"ing":"Water","amount":"1 cup "},{"ing":"Tamarind Paste","amount":"2 tbs"},{"ing":"Lime","amount":"6"},{"ing":"Sugar","amount":"1 tbs"},{"ing":"Challots","amount":"5"}],"steps":["Chop the spice paste ingredients and then blend it in a food processor until fine.","Heat the oil in a stew pot, add the spice paste, cinnamon, cloves, star anise, and cardamom and stir-fry until aromatic. Add the beef and the pounded lemongrass and stir for 1 minute. Add the coconut milk, tamarind juice, water, and simmer on medium heat, stirring frequently until the meat is almost cooked. Add the kaffir lime leaves, kerisik (toasted coconut), sugar or palm sugar, stirring to blend well with the meat.","Lower the heat to low, cover the lid, and simmer for 1 to 1 1/2 hours or until the meat is really tender and the gravy has dried up. Add more salt and sugar to taste. Serve immediately with steamed rice and save some for overnight."],"imgUrl":"https://www.themealdb.com/images/media/meals/bc8v651619789840.jpg","tags":["Misc"]},{"title":"Burek","category":"Side","region":"Croatian","ingList":[{"ing":"Filo Pastry","amount":"1 Packet"},{"ing":"Minced Beef","amount":"150g"},{"ing":"Onion","amount":"150g"},{"ing":"Oil","amount":"40g"},{"ing":"Salt","amount":"Dash"},{"ing":"Pepper","amount":"Dash"}],"steps":["Fry the finely chopped onions and minced meat in oil. Add the salt and pepper. Grease a round baking tray and put a layer of pastry in it. Cover with a thin layer of filling and cover this with another layer of filo pastry which must be well coated in oil. Put another layer of filling and cover with pastry. When you have five or six layers, cover with filo pastry, bake at 200ºC/392ºF for half an hour and cut in quarters and serve."],"imgUrl":"https://www.themealdb.com/images/media/meals/tkxquw1628771028.jpg","tags":["Streetfood"," Onthego"]},{"title":"Beef Mechado","category":"Beef","region":"Filipino","ingList":[{"ing":"Garlic","amount":"3 cloves"},{"ing":"Onion","amount":"1 sliced"},{"ing":"Beef","amount":"2 Lbs"},{"ing":"Tomato Puree","amount":"8 ounces"},{"ing":"Water","amount":"1 cup "},{"ing":"Olive Oil","amount":"3 tbs"},{"ing":"Lemon","amount":"1 Slice"},{"ing":"Potatoes","amount":"1 large"},{"ing":"Soy Sauce","amount":"1/4 cup"},{"ing":"Black Pepper","amount":"1/2 tsp"},{"ing":"Bay Leaves","amount":"2"},{"ing":"Salt","amount":"To taste"}],"steps":["0.\tMake the beef tenderloin marinade by combining soy sauce, vinegar, ginger, garlic, sesame oil, olive oil, sugar, salt, and ground black pepper in a large bowl. Mix well.","1.\tAdd the cubed beef tenderloin to the bowl with the beef tenderloin marinade. Gently toss to coat the beef. Let it stay for 1 hour.","2.\tUsing a metal or bamboo skewer, assemble the beef kebob by skewering the vegetables and marinated beef tenderloin.","3.\tHeat-up the grill and start grilling the beef kebobs for 3 minutes per side. This will give you a medium beef that is juicy and tender on the inside. Add more time if you want your beef well done, but it will be less tender.","4.\tTransfer to a serving plate. Serve with Saffron rice.","5.\tShare and enjoy!",""],"imgUrl":"https://www.themealdb.com/images/media/meals/cgl60b1683206581.jpg","tags":["Stew"," Warming"]},{"title":"Bistek","category":"Beef","region":"Filipino","ingList":[{"ing":"Beef","amount":"1 lb"},{"ing":"Soy Sauce","amount":"5 tablespoons"},{"ing":"Lemon","amount":"1"},{"ing":"Garlic","amount":"3 cloves"},{"ing":"Onion","amount":"3 parts "},{"ing":"Olive Oil","amount":"4 tbs"},{"ing":"Water","amount":"1 cup "},{"ing":"Salt","amount":"1 pinch"}],"steps":["0.\tMarinate beef in soy sauce, lemon (or calamansi), and ground black pepper for at least 1 hour. Note: marinate overnight for best result","1.\tHeat the cooking oil in a pan then pan-fry half of the onions until the texture becomes soft. Set aside","2.\tDrain the marinade from the beef. Set it aside. Pan-fry the beef on the same pan where the onions were fried for 1 minute per side. Remove from the pan. Set aside","3.\tAdd more oil if needed. Saute garlic and remaining raw onions until onion softens.","4.\tPour the remaining marinade and water. Bring to a boil.","5.\tAdd beef. Cover the pan and simmer until the meat is tender. Note: Add water as needed.","6.\tSeason with ground black pepper and salt as needed. Top with pan-fried onions.","7.\tTransfer to a serving plate. Serve hot. Share and Enjoy!",""],"imgUrl":"https://www.themealdb.com/images/media/meals/4pqimk1683207418.jpg","tags":["Misc"]},{"title":"Beef Caldereta","category":"Beef","region":"Filipino","ingList":[{"ing":"Beef","amount":"2kg cut cubes"},{"ing":"Beef Stock","amount":"1"},{"ing":"Soy Sauce","amount":"1 tbs"},{"ing":"Water","amount":"2 cups "},{"ing":"Green Pepper","amount":"1 sliced"},{"ing":"Red Pepper","amount":"1 sliced"},{"ing":"Potatoes","amount":"1 sliced"},{"ing":"Carrots","amount":"1 sliced"},{"ing":"Tomato Puree","amount":"8 ounces"},{"ing":"Peanut Butter","amount":"3  tablespoons"},{"ing":"Chilli Powder","amount":"5"},{"ing":"Onion","amount":"1 chopped"},{"ing":"Garlic","amount":"5 cloves"},{"ing":"Olive Oil","amount":"3 tbs"}],"steps":["0.\tHeat oil in a cooking pot. Saute onion and garlic until onion softens","1.\tAdd beef. Saute until the outer part turns light brown.","2.\tAdd soy sauce. Pour tomato sauce and water. Let boil.","3.\tAdd Knorr Beef Cube. Cover the pressure cooker. Cook for 30 minutes.","4.\tPan-fry carrot and potato until it browns. Set aside.","5.\tAdd chili pepper, liver spread and peanut butter. Stir.","6.\tAdd bell peppers, fried potato and carrot. Cover the pot. Continue cooking for 5 to 7 minutes.","7.\tSeason with salt and ground black pepper. Serve.",""],"imgUrl":"https://www.themealdb.com/images/media/meals/41cxjh1683207682.jpg","tags":["Misc"]},{"title":"Beef Asado","category":"Beef","region":"Filipino","ingList":[{"ing":"Beef","amount":"1.5kg"},{"ing":"Beef Stock Concentrate","amount":"1"},{"ing":"Tomato Puree","amount":"8 ounces"},{"ing":"Water","amount":"3 cups "},{"ing":"Soy Sauce","amount":"6 tablespoons"},{"ing":"White Wine Vinegar","amount":"1 tbs"},{"ing":"Pepper","amount":"2 tbs"},{"ing":"Bay Leaf","amount":"4"},{"ing":"Lemon","amount":"1/2 "},{"ing":"Tomato Sauce","amount":"2 tbs"},{"ing":"Butter","amount":"3 tbs"},{"ing":"Olive Oil","amount":"1/2 cup "},{"ing":"Onion","amount":"1 chopped"},{"ing":"Garlic","amount":"4 cloves"}],"steps":["0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.","1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.","2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.","3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.","4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.","5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.","6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.","7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half."],"imgUrl":"https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg","tags":["Misc"]},{"title":"Bread omelette","category":"Breakfast","region":"Indian","ingList":[{"ing":"Bread","amount":"2"},{"ing":"Egg","amount":"2"},{"ing":"Salt","amount":"0.5"}],"steps":["Make and enjoy"],"imgUrl":"https://www.themealdb.com/images/media/meals/hqaejl1695738653.jpg","tags":["Misc"]},{"title":"Beetroot Soup (Borscht)","category":"Vegetarian","region":"Russian","ingList":[{"ing":"Beetroot","amount":"3"},{"ing":"Olive Oil","amount":"4 tbs"},{"ing":"Chicken Stock Cube","amount":"1"},{"ing":"Water","amount":"6 cups "},{"ing":"Potatoes","amount":"3"},{"ing":"Cannellini Beans","amount":"1 can "},{"ing":"Dill","amount":"Garnish"}],"steps":["Chop the beetroot, add water and stock cube and cook for 15mins. Add the other ingredients and boil until soft. Finally add the beans and cook for 5mins. Serve in the soup pot."],"imgUrl":"https://www.themealdb.com/images/media/meals/zadvgb1699012544.jpg","tags":["soup"]},{"title":"Blini Pancakes","category":"Side","region":"Russian","ingList":[{"ing":"Buckwheat","amount":"1/2 cup "},{"ing":"Flour","amount":"2/3 Cup"},{"ing":"Salt","amount":"1/2 tsp"},{"ing":"Yeast","amount":"1 tsp "},{"ing":"Milk","amount":"1 cup "},{"ing":"Butter","amount":"2 tbs"},{"ing":"Egg","amount":"1 Seperated"}],"steps":["In a large bowl, whisk together 1/2 cup buckwheat flour, 2/3 cup all-purpose flour, 1/2 teaspoon salt, and 1 teaspoon yeast.","","Make a well in the center and pour in 1 cup warm milk, whisking until the batter is smooth.","","Cover the bowl and let the batter rise until doubled, about 1 hour.","","Enrich and Rest the Batter","Stir 2 tablespoons melted butter and 1 egg yolk into the batter.","","In a separate bowl, whisk 1 egg white until stiff, but not dry.","","Fold the whisked egg white into the batter.","","Cover the bowl and let the batter stand 20 minutes.","","Pan-Fry the Blini","Heat butter in a large nonstick skillet over medium heat.","","Drop quarter-sized dollops of batter into the pan, being careful not to overcrowd the pan. Cook for about 1 minute or until bubbles form.","","Turn and cook for about 30 additional seconds.","","Remove the finished blini onto a plate and cover them with a clean kitchen towel to keep warm. Add more butter to the pan and repeat the frying process with the remaining batter."],"imgUrl":"https://www.themealdb.com/images/media/meals/0206h11699013358.jpg","tags":["pancake"]}]