[
    {
        "title": "Eton Mess",
        "category": "Dessert",
        "region": "British",
        "ingList": [
            {
                "ing": "strawberries",
                "amount": "500g"
            },
            {
                "ing": "double cream",
                "amount": "400ml"
            },
            {
                "ing": "meringue nests",
                "amount": "3 x 7.5cm"
            },
            {
                "ing": "ginger cordial",
                "amount": "1 tbsp"
            },
            {
                "ing": "Mint",
                "amount": "sprigs of fresh"
            }
        ],
        "steps": [
            "Purée half the strawberries in a blender. Chop the remaining strawberries, reserving four for decoration.",
            "Whip the double cream until stiff peaks form, then fold in the strawberry purée and crushed meringue. Fold in the chopped strawberries and ginger cordial, if using.",
            "Spoon equal amounts of the mixture into four cold wine glasses. Serve garnished with the remaining strawberries and a sprig of mint."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/uuxwvq1483907861.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=43WgiNq54L8",
        "tags": ["Dairy", "Fruity", "Desert", "Treat", "Speciality"]
    },
    {
        "title": "Eccles Cakes",
        "category": "Dessert",
        "region": "British",
        "ingList": [
            {
                "ing": "Butter",
                "amount": "250g"
            },
            {
                "ing": "Plain Flour",
                "amount": "350g"
            },
            {
                "ing": "Lemon",
                "amount": "Juice of 1/2"
            },
            {
                "ing": "Butter",
                "amount": "25g"
            },
            {
                "ing": "Currants",
                "amount": "200g"
            },
            {
                "ing": "Mixed Peel",
                "amount": "50g"
            },
            {
                "ing": "Muscovado Sugar",
                "amount": "100g "
            },
            {
                "ing": "Cinnamon",
                "amount": "1 tsp "
            },
            {
                "ing": "Ginger",
                "amount": "1 tsp "
            },
            {
                "ing": "Allspice",
                "amount": "1 tsp "
            },
            {
                "ing": "Lemon",
                "amount": "Zest of 1"
            },
            {
                "ing": "Eggs",
                "amount": "1 beaten"
            },
            {
                "ing": "Sugar",
                "amount": "spinkling"
            }
        ],
        "steps": [
            "To make the pastry, dice the butter and put it in the freezer to go really hard. Tip flour into the bowl of a food processor with half the butter and pulse to the texture of breadcrumbs. Pour in the lemon juice and 100ml iced water, and pulse to a dough. Tip in the rest of the butter and pulse a few times until the dough is heavily flecked with butter. It is important that you don’t overdo this as the flecks of butter are what makes the pastry flaky.",
            "On a floured surface roll the pastry out to a neat rectangle about 20 x 30cm. Fold the two ends of the pastry into the middle (See picture 1), then fold in half (pic 2). Roll the pastry out again and refold the same way 3 more times resting the pastry for at least 15 mins each time between roll and fold, then leave to rest in the fridge for at least 30 mins before using.",
            "To make the filling, melt the butter in a large saucepan. Take it off the heat and stir in all the other ingredients until completely mixed, then set aside.",
            "To make the cakes, roll the pastry out until it’s just a little thicker than a £1 coin and cut out 8 rounds about 12cm across. Re-roll the trimming if needed. Place a good heaped tablespoon of mixture in the middle of each round, brush the edges of the rounds with water, then gather the pastry around the filling and squeeze it together (pic 3). Flip them over so the smooth top is upwards and pat them into a smooth round. Flatten each round with a rolling pin to an oval until the fruit just starts to poke through, then place on a baking tray. Cut 2 little slits in each Eccles cakes, brush generously with egg white and sprinkle with the sugar (pic 4).",
            "Heat the oven to 220C/200C fan/gas 8. Bake the Eccles cakes for 15-20 mins until just past golden brown and sticky. Leave to cool on a rack and enjoy while still warm or cold with a cup of tea. If you prefer, Eccles cakes also go really well served with a wedge of hard, tangy British cheese such as Lancashire or cheddar."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/wtqrqw1511639627.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=xV0QCJ0GD5w",
        "tags": ["Snack", "Treat"]
    },
    {
        "title": "English Breakfast",
        "category": "Breakfast",
        "region": "British",
        "ingList": [
            {
                "ing": "Sausages",
                "amount": "2"
            },
            {
                "ing": "Bacon",
                "amount": "3"
            },
            {
                "ing": "Mushrooms",
                "amount": "2"
            },
            {
                "ing": "Tomatoes",
                "amount": "2"
            },
            {
                "ing": "Black Pudding",
                "amount": "1 Slice"
            },
            {
                "ing": "Eggs",
                "amount": "2"
            },
            {
                "ing": "Bread",
                "amount": "1 Slice"
            }
        ],
        "steps": [
            "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.",
            "Cook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.",
            "Snip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.",
            "For the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.",
            "For the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.",
            "For the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.",
            "For 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.",
            "For the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.",
            "Once all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/utxryw1511721587.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=FXjYU2Ensck",
        "tags": ["Breakfast"]
    },
    {
        "title": "Escovitch Fish",
        "category": "Seafood",
        "region": "Jamaican",
        "ingList": [
            {
                "ing": "Red Snapper",
                "amount": "2 Pounds"
            },
            {
                "ing": "Vegetable Oil",
                "amount": "1/2 cup "
            },
            {
                "ing": "Garlic",
                "amount": "1 clove peeled crushed"
            },
            {
                "ing": "Ginger",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Thyme",
                "amount": "2 sprigs"
            },
            {
                "ing": "Bay Leaf",
                "amount": "1"
            },
            {
                "ing": "Red Pepper",
                "amount": "0.5"
            },
            {
                "ing": "Yellow Pepper",
                "amount": "0.5"
            },
            {
                "ing": "Onion",
                "amount": "1 sliced"
            },
            {
                "ing": "Carrots",
                "amount": "1 chopped"
            },
            {
                "ing": "Sugar",
                "amount": "1 tbs"
            },
            {
                "ing": "Allspice",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Worcestershire Sauce",
                "amount": "1 tsp "
            },
            {
                "ing": "Scotch Bonnet",
                "amount": "1"
            },
            {
                "ing": "Lime",
                "amount": "1"
            },
            {
                "ing": "Malt Vinegar",
                "amount": "3/4 cup "
            },
            {
                "ing": "Pepper",
                "amount": "pinch"
            }
        ],
        "steps": [
            "Rinse fish; rub with lemon or lime, seasoned with salt and pepper or use your favorite seasoning. I used creole seasoning. Set aside or place in the oven to keep it warm until sauce is ready.",
            "",
            "In large skillet heat oil over medium heat, until hot, add the fish, cook each side- for about 5-7 minutes until cooked through and crispy on both sides. Remove fish and set aside. Drain oil and leave about 2-3 tablespoons of oil",
            "Add, bay leave, garlic and ginger, stir-fry for about a minute making sure the garlic does not burn",
            "Then add onion, bell peppers, thyme, scotch bonnet, sugar, all spice-continue stirring for about 2-3 minutes. Add vinegar, mix an adjust salt and pepper according to preference. Let it simmer for about 2 more minutes. ",
            "",
            "Discard bay leave, thyme spring and serve over fish with a side of this bammy. You may make the sauce about 2 days in advance."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/1520084413.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=nF6DOtGE6k8",
        "tags": ["Seafood", "Spicy", "Speciality", "Easter"]
    },
    {
        "title": "Egg Drop Soup",
        "category": "Vegetarian",
        "region": "Chinese",
        "ingList": [
            {
                "ing": "Chicken Stock",
                "amount": "3 cups "
            },
            {
                "ing": "Salt",
                "amount": "1/4 tsp"
            },
            {
                "ing": "Sugar",
                "amount": "1/4 tsp"
            },
            {
                "ing": "Pepper",
                "amount": "pinch"
            },
            {
                "ing": "Sesame Seed Oil",
                "amount": "1 tsp "
            },
            {
                "ing": "Peas",
                "amount": "1/3 cup"
            },
            {
                "ing": "Mushrooms",
                "amount": "1/3 cup"
            },
            {
                "ing": "Cornstarch",
                "amount": "1 tbs"
            },
            {
                "ing": "Water",
                "amount": "2 tbs"
            },
            {
                "ing": "Spring Onions",
                "amount": "1/4 cup"
            }
        ],
        "steps": [
            "In a wok add chicken broth and wait for it to boil.",
            "Next add salt, sugar, white pepper, sesame seed oil.",
            "When the chicken broth is boiling add the vegetables to the wok.",
            "To thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.",
            "Next add 1 egg slightly beaten with a knife or fork and add it to the soup slowly and stir for 8 seconds",
            "Serve the soup in a bowl and add the green onions on top."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/1529446137.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=9XpzHm9QpZg",
        "tags": ["Soup", "Baking", "Calorific"]
    },
    {
        "title": "Egyptian Fatteh",
        "category": "Beef",
        "region": "Egyptian",
        "ingList": [
            {
                "ing": "Beef",
                "amount": "1lb"
            },
            {
                "ing": "Onion",
                "amount": "1"
            },
            {
                "ing": "Chicken Stock Cube",
                "amount": "1"
            },
            {
                "ing": "Tomatoes",
                "amount": "2"
            },
            {
                "ing": "Garlic Clove",
                "amount": "4"
            },
            {
                "ing": "Tomato Puree",
                "amount": "1 tbs"
            },
            {
                "ing": "Rice",
                "amount": "2 cups "
            },
            {
                "ing": "Noodles",
                "amount": "1/4 cup"
            },
            {
                "ing": "Butter",
                "amount": "1/4 cup"
            },
            {
                "ing": "Olive Oil",
                "amount": "2 cups "
            },
            {
                "ing": "Pita Bread",
                "amount": "1"
            },
            {
                "ing": "Cumin",
                "amount": "1 tbs"
            },
            {
                "ing": "White Wine Vinegar",
                "amount": "3 tbs"
            },
            {
                "ing": "Salt",
                "amount": "To taste"
            },
            {
                "ing": "Pepper",
                "amount": "To taste"
            }
        ],
        "steps": [
            "To prepare bread for bottom of dish: Take pita bread and rip into bite size pieces. In a frying pan, add about a 1/4 stick of butter, add bread pieces and fry until golden brown and crisp. Put these pieces in a glass baking dish, preferably a square sized dish. Set aside.",
            "Then add to same pan, a little more butter, salt, approximately 2 cloves of crushed fresh garlic, and a teaspoon or so of cumin stir around a bit until you can smell aroma, then add fried bread pieces to this mixture, stir to coat bread and put back into glass baking dish. Set aside.",
            "To prepare meat: put some butter in a pot, stir fry meat until brown, add 1 onion quartered, salt & pepper, 1 cube of chicken bouillon and water to cover meat. Bring to a boil, turn down to simmer, cover and cook until tender, approximately 2 hours. After meat has cooled, take out chunks of meat and put in a bowl, set aside. Reserve soup from the meat separately.",
            "To prepare the rice: Put some butter into a pot, add shareya (fideo noodles) like a handful or so, keep stirring until golden brown, not too dark, but very golden. Then add two cups of rice, stir a little bit until some of the rice turns an opaque white. Add 2-1/4 cups of water and salt to taste. Bring to a boil, cover and turn down to simmer, cook until tender. Test the rice tenderness after about 35 minutes.",
            "Now take some of the soup from meat and add to the top of the bread pieces in baking dish to saturate.Add cooked rice on top of bread pieces. Slowly spoon remainder of soup onto rice, looking at glass dish sides to see level of soup, should reach just to top of rice, don’t worry, this doesn’t have to be exact. Now you’re ready to make the sauce and fry the meat to put on top.",
            "To prepare red sauce: In a pan, add a little oil or butter, crushed tomato, a half teaspoon of tomato paste, salt & pepper, 2 cloves of fresh crushed garlic and cumin. Add also approximately 3 tablespoons of vinegar, stir this until you smell aroma and it is a bit smooth. It should be a bit thick, not watery, but if too thick you can add a bit of water. Spread with a wooden spoon atop the rice to cover.",
            "To fry meat: In a pan add a bit of butter or oil, the meat, just a touch of tomato paste, about a tablespoon of fresh crushed garlic, salt & pepper, a teaspoon of cumin. Cook until meat is golden fried.",
            "Spoon this atop the rice and serve. Enjoy!"
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/rlwcc51598734603.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=WLuOHkDE4A4",
        "tags": ["Misc"]
    },
    {
        "title": "Eggplant Adobo",
        "category": "Vegetarian",
        "region": "Filipino",
        "ingList": [
            {
                "ing": "Egg Plants",
                "amount": "1 lb"
            },
            {
                "ing": "Sugar",
                "amount": "2 tbs"
            },
            {
                "ing": "Salt",
                "amount": "1 tsp "
            },
            {
                "ing": "Pepper",
                "amount": "1 tsp "
            },
            {
                "ing": "Garlic",
                "amount": "1 whole"
            },
            {
                "ing": "Olive Oil",
                "amount": "3 tbs"
            },
            {
                "ing": "Ground Pork",
                "amount": "4 oz "
            },
            {
                "ing": "Rice Vinegar",
                "amount": "3 tbs"
            },
            {
                "ing": "Soy Sauce",
                "amount": "2 tbs"
            },
            {
                "ing": "Bay Leaf",
                "amount": "2"
            }
        ],
        "steps": [
            "1.\tSlice 1 lb. small Japanese or Italian eggplant (about 3) into quarters lengthwise, then cut crosswise into 2\"-wide pieces. Place in a medium bowl. Add 1 Tbsp. sugar, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ½ tsp. freshly ground black pepper. Toss to evenly coat eggplant and let sit at room temperature at least 20 minutes and up to 2 hours.",
            "2.\tPeel and thinly slice 8 garlic cloves. Add 3 Tbsp. vegetable oil and half of garlic to a medium Dutch oven or other heavy pot. Cook over medium-high heat, stirring constantly with a wooden spoon, until light golden and crisp, about 5 minutes. Using a slotted spoon, transfer garlic chips to a plate; season lightly with salt.",
            "3. Place 4 oz. ground pork in same pot and break up into small pieces with wooden spoon. Season with ¼ tsp. Diamond Crystal or Morton kosher salt and cook, undisturbed, until deeply browned underneath, about 5 minutes. Using a slotted spoon, transfer to another plate, leaving fat behind in the pot.",
            "4. Place eggplant on a clean kitchen towel and blot away any moisture the salt has drawn out.",
            "5. Working in batches and adding more oil if needed, cook eggplant in the same pot until lightly browned, about 3 minutes per side. Transfer to a plate with pork.",
            "6. Pour 1½ cups of water into the pot and scrape up browned bits from the bottom with a wooden spoon. Add remaining garlic, 3 Tbsp. coconut vinegar or unseasoned rice vinegar, 2 Tbsp. soy sauce, 2 bay leaves, 1 tsp. freshly ground black pepper, and remaining 1 Tbsp. sugar. Bring to a simmer, then return pork and eggplant to pot. Reduce heat to medium-low, partially cover, and simmer until eggplant is tender and silky and sauce is reduced by half, 20–25 minutes. Taste and season with more salt and pepper and add a little more sugar if needed.",
            "7. Top with garlic chips and serve with cooked white rice.",
            ""
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/y7h0lq1683208991.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=pKXACYjwMns",
        "tags": ["Misc"]
    }
]
