[
    {
        "title": "Garides Saganaki",
        "category": "Seafood",
        "region": "Greek",
        "ingList": [
            {
                "ing": "Raw king prawns",
                "amount": "500g"
            },
            {
                "ing": "Olive oil",
                "amount": "3 tablespoons"
            },
            {
                "ing": "Chopped onion",
                "amount": "1"
            },
            {
                "ing": "Freshly chopped parsley",
                "amount": "pinch"
            },
            {
                "ing": "White wine",
                "amount": "250ml"
            },
            {
                "ing": "Chopped tomatoes",
                "amount": "1 (400g) tin"
            },
            {
                "ing": "Minced garlic",
                "amount": "1/2 teaspoon"
            },
            {
                "ing": "Cubed Feta cheese",
                "amount": "1 (200g) pack"
            }
        ],
        "steps": [
            "Place the prawns in a pot and add enough water to cover. Boil for 5 minutes. Drain, reserving the liquid, and set aside.",
            "Heat 2 tablespoons of oil in a saucepan. Add the onion; cook and stir until soft. Mix in the parsley, wine, tomatoes, garlic and remaining olive oil. Simmer, stirring occasionally, for about 30 minutes, or until the sauce is thickened.",
            "While the sauce is simmering, the prawns should become cool enough to handle. First remove the legs by pinching them, and then pull off the shells, leaving the head and tail on.",
            "When the sauce has thickened, stir in the prawns. Bring to a simmer again if the sauce has cooled with the prawns, and cook for about 5 minutes. Add the feta and remove from the heat. Let stand until the cheese starts to melt. Serve warm with slices of crusty bread.",
            "Though completely untraditional, you can add a few tablespoons of stock or passata to this recipe to make a delicious pasta sauce. Toss with pasta after adding the feta, and serve."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/wuvryu1468232995.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=uO0ejc85zSE",
        "tags": ["Seafood", "Shellfish"]
    },
    {
        "title": "Grilled Mac and Cheese Sandwich",
        "category": "Pasta",
        "region": "American",
        "ingList": [
            {
                "ing": "Macaroni",
                "amount": "8 ounces (230 grams)"
            },
            {
                "ing": "Plain Flour",
                "amount": "1/3 cup"
            },
            {
                "ing": "Mustard Powder",
                "amount": "3/4 teaspoon"
            },
            {
                "ing": "Garlic powder",
                "amount": "1/2 teaspoon"
            },
            {
                "ing": "Kosher salt",
                "amount": "1/2 teaspoon"
            },
            {
                "ing": "Black pepper",
                "amount": "1/2 teaspoon"
            },
            {
                "ing": "Cayenne pepper",
                "amount": "1/8 teaspoon"
            },
            {
                "ing": "Butter",
                "amount": "6 tablespoons (85 grams)"
            },
            {
                "ing": "Whole Milk",
                "amount": "1 1/2 cups (360 milliliters)"
            },
            {
                "ing": "Heavy Cream",
                "amount": "1 cup (240 milliliters)"
            },
            {
                "ing": "Monterey Jack Cheese",
                "amount": "1 pound (455 grams) "
            },
            {
                "ing": "Butter",
                "amount": "4 tablespoons (55 grams)"
            },
            {
                "ing": "garlic powder",
                "amount": "1 teaspoon"
            },
            {
                "ing": "Bread",
                "amount": "16 slices square"
            },
            {
                "ing": "Cheddar Cheese",
                "amount": "8 slices mild"
            },
            {
                "ing": "Colby Jack Cheese",
                "amount": "8 slices"
            },
            {
                "ing": "Butter",
                "amount": "4 tablespoons (55 grams)"
            }
        ],
        "steps": [
            "Make the mac and cheese",
            "",
            "1. Bring a medium saucepan of generously salted water (you want it to taste like seawater) to a boil. Add the pasta and cook, stirring occasionally, until al dente, 8 to 10 minutes, or according to the package directions. The pasta should be tender but still chewy.",
            "2. While the pasta is cooking, in a small bowl, whisk together the flour, mustard powder, garlic powder, salt, black pepper, and cayenne pepper.",
            "3. Drain the pasta in a colander. Place the empty pasta pan (no need to wash it) over low heat and add the butter. When the butter has melted, whisk in the flour mixture and continue to cook, whisking frequently, until the mixture is beginning to brown and has a pleasant, nutty aroma, about 1 minute. Watch carefully so it does not scorch on the bottom of the pan.",
            "4. Slowly whisk the milk and cream into the flour mixture until everything is really well combined. Cook, whisking constantly, until the sauce is heated through and just begins to thicken, about 2 minutes. Remove from the heat. Gradually add the cheese while stirring constantly with a wooden spoon or silicone spatula and keep stirring until the cheese has melted into the sauce. Then stir in the drained cooked pasta.",
            "5. Line a 9-by-13-inch (23-by-33-centimeter) rimmed baking sheet with parchment paper or aluminum foil. Coat the paper or foil with nonstick cooking spray or slick it with butter. Pour the warm mac and cheese onto the prepared baking sheet and spread it evenly with a spatula. Coat another piece of parchment paper with cooking spray or butter and place it, oiled or buttered side down, directly on the surface of the mac and cheese. Refrigerate until cool and firm, about 1 hour.",
            "",
            "Make the grilled cheese",
            "6. Heat a large cast-iron or nonstick skillet over medium-low heat.",
            "7. In a small bowl, stir together the 4 tablespoons (55 grams) butter and garlic powder until well blended.",
            "8. Remove the mac and cheese from the refrigerator and peel off the top layer of parchment paper. Carefully cut into 8 equal pieces. Each piece will make 1 grilled mac and cheese sandwich. (You can stash each individual portion in a double layer of resealable plastic bags and refrigerate for up to 3 days or freeze it for up to 1 month.)",
            "9. Spread 3/4 teaspoon garlic butter on one side of each bread slice. Place half of the slices, buttered-side down, on a clean cutting board. Top each with one slice of Cheddar, then 1 piece of the mac and cheese. (Transfer from the baking sheet by scooting your hand or a spatula under each piece of mac and cheese and then flipping it over onto a sandwich.) Place 1 slice of Jack on top of each. Finish with the remaining bread slices, buttered-side up.",
            "10. Using a wide spatula, place as many sandwiches in the pan as will fit without crowding it. Cover and cook until the bottoms are nicely browned, about 4 minutes. Turn and cook until the second sides are browned, the cheese is melted, and the mac and cheese is heated through, about 4 minutes more.",
            "11. Repeat with the remaining ingredients. Cut the sandwiches in half, if desired, and serve."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/xutquv1505330523.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=PYq31xLj-DY",
        "tags": ["Misc"]
    },
    {
        "title": "General Tso's Chicken",
        "category": "Chicken",
        "region": "Chinese",
        "ingList": [
            {
                "ing": "Chicken Breast",
                "amount": "1 1/2 "
            },
            {
                "ing": "Plain Flour",
                "amount": "3/4 cup "
            },
            {
                "ing": "Egg",
                "amount": "1"
            },
            {
                "ing": "Starch",
                "amount": "2 tbs"
            },
            {
                "ing": "Baking Powder",
                "amount": "1 tbs"
            },
            {
                "ing": "Salt",
                "amount": "1 tsp "
            },
            {
                "ing": "Onion Salt",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Garlic Powder",
                "amount": "1/4 tsp"
            },
            {
                "ing": "Water",
                "amount": "3/4 cup "
            },
            {
                "ing": "Chicken Stock",
                "amount": "1/2 cup "
            },
            {
                "ing": "Duck Sauce",
                "amount": "1/4 cup"
            },
            {
                "ing": "Soy Sauce",
                "amount": "3 tbs"
            },
            {
                "ing": "Honey",
                "amount": "2 tbs"
            },
            {
                "ing": "Rice Vinegar",
                "amount": "1 tbs"
            },
            {
                "ing": "Sesame Seed Oil",
                "amount": "2 tbs"
            },
            {
                "ing": "Gochujang",
                "amount": "1/2 tbs"
            },
            {
                "ing": "Starch",
                "amount": "2 tbs"
            },
            {
                "ing": "Garlic",
                "amount": "1 clove"
            },
            {
                "ing": "Spring Onions",
                "amount": "2 chopped"
            },
            {
                "ing": "Ginger",
                "amount": "1 tsp "
            }
        ],
        "steps": [
            "DIRECTIONS:",
            "STEP 1 - SAUCE",
            "In a bowl, add 2 Cups of water, 2 Tablespoon soy sauce, 2 Tablespoon white vinegar, sherry cooking wine, 1/4 Teaspoon white pepper, minced ginger, minced garlic, hot pepper, ketchup, hoisin sauce, and sugar.",
            "Mix together well and set aside.",
            "STEP 2 - MARINATING THE CHICKEN",
            "In a bowl, add the chicken, 1 pinch of salt, 1 pinch of white pepper, 2 egg whites, and 3 Tablespoon of corn starch",
            "STEP 3 - DEEP FRY THE CHICKEN",
            "Deep fry the chicken at 350 degrees for 3-4 minutes or until it is golden brown and loosen up the chicken so that they don't stick together.",
            "Set the chicken aside.",
            "STEP 4 - STIR FRY",
            "Add the sauce to the wok and then the broccoli and wait until it is boiling.",
            "To thicken the sauce, whisk together 2 Tablespoon of cornstarch and 4 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.",
            "Next add in the chicken and stir-fry for a minute and serve on a plate"
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/1529444113.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=wWGwz0iBmvU",
        "tags": ["Misc"]
    },
    {
        "title": "Gigantes Plaki",
        "category": "Vegetarian",
        "region": "Greek",
        "ingList": [
            {
                "ing": "Butter Beans",
                "amount": "400g"
            },
            {
                "ing": "Olive Oil",
                "amount": "3 tbs"
            },
            {
                "ing": "Onion",
                "amount": "1 chopped"
            },
            {
                "ing": "Garlic Clove",
                "amount": "2 chopped"
            },
            {
                "ing": "Tomato Puree",
                "amount": "2 tbs"
            },
            {
                "ing": "Tomatoes",
                "amount": "800g"
            },
            {
                "ing": "Sugar",
                "amount": "1 tbs"
            },
            {
                "ing": "Dried Oregano",
                "amount": "1 tbs"
            },
            {
                "ing": "Cinnamon",
                "amount": "Pinch"
            },
            {
                "ing": "Chopped Parsley",
                "amount": "2 tbs"
            }
        ],
        "steps": [
            "Soak the beans overnight in plenty of water. Drain, rinse, then place in a pan covered with water. Bring to the boil, reduce the heat, then simmer for approx 50 mins until slightly tender but not soft. Drain, then set aside.",
            "",
            "Heat oven to 180C/160C fan/gas 4. Heat the olive oil in a large frying pan, tip in the onion and garlic, then cook over a medium heat for 10 mins until softened but not browned. Add the tomato purée, cook for a further min, add remaining ingredients, then simmer for 2-3 mins. Season generously, then stir in the beans. Tip into a large ovenproof dish, then bake for approximately 1 hr, uncovered and without stirring, until the beans are tender. The beans will absorb all the fabulous flavours and the sauce will thicken. Allow to cool, then scatter with parsley and drizzle with a little more olive oil to serve."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/b79r6f1585566277.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=e-2K2iyPASA",
        "tags": ["Misc"]
    },
    {
        "title": "Gołąbki (cabbage roll)",
        "category": "Beef",
        "region": "Polish",
        "ingList": [
            {
                "ing": "Cabbage",
                "amount": "1"
            },
            {
                "ing": "Butter",
                "amount": "2 tbs"
            },
            {
                "ing": "Onion",
                "amount": "1 chopped"
            },
            {
                "ing": "Ground Beef",
                "amount": "1 lb"
            },
            {
                "ing": "Ground Pork",
                "amount": "1/2 lb"
            },
            {
                "ing": "Rice",
                "amount": "1 1/2 cups "
            },
            {
                "ing": "Garlic",
                "amount": "1 tsp "
            },
            {
                "ing": "Salt",
                "amount": "1 tsp "
            },
            {
                "ing": "Black Pepper",
                "amount": "1/4 tsp"
            },
            {
                "ing": "Tomato Puree",
                "amount": "3 cans"
            }
        ],
        "steps": [
            "Bring a large pot of lightly salted water to a boil. Place cabbage head into water, cover pot, and cook until cabbage leaves are slightly softened enough to remove from head, 3 minutes. Remove cabbage from pot and let cabbage sit until leaves are cool enough to handle, about 10 minutes.",
            "",
            "Remove 18 whole leaves from the cabbage head, cutting out any thick tough center ribs. Set whole leaves aside. Chop the remainder of the cabbage head and spread it in the bottom of a casserole dish.",
            "",
            "Melt butter in a large skillet over medium-high heat. Cook and stir onion in hot butter until tender, 5 to 10 minutes. Cool.",
            "",
            "Stir onion, beef, pork, rice, garlic, 1 teaspoon salt, and 1/4 teaspoon pepper together in a large bowl.",
            "",
            "Preheat oven to 350 degrees F (175 degrees C).",
            "",
            "Place about 1/2 cup beef mixture on a cabbage leaf. Roll cabbage around beef mixture, tucking in sides to create an envelope around the meat. Repeat with remaining leaves and meat mixture. Place cabbage rolls in a layer atop the chopped cabbage in the casserole dish; season rolls with salt and black pepper.",
            "",
            "Whisk tomato soup, tomato juice, and ketchup together in a bowl. Pour tomato soup mixture over cabbage rolls and cover dish wish aluminum foil.",
            "",
            "Bake in the preheated oven until cabbage is tender and meat is cooked through, about 1 hour."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/q8sp3j1593349686.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=rBrTkDdoPYg",
        "tags": ["Misc"]
    },
    {
        "title": "Grilled Portuguese sardines",
        "category": "Seafood",
        "region": "Portuguese",
        "ingList": [
            {
                "ing": "Sardines",
                "amount": "8"
            },
            {
                "ing": "Olive Oil",
                "amount": "2 tbs"
            },
            {
                "ing": "Garlic",
                "amount": "3 cloves"
            },
            {
                "ing": "Paprika",
                "amount": "1 tbs"
            },
            {
                "ing": "Lemon",
                "amount": "1/2 "
            },
            {
                "ing": "Rosemary",
                "amount": "4 sprigs"
            },
            {
                "ing": "Red Chilli",
                "amount": "1"
            }
        ],
        "steps": [
            "STEP 1",
            "",
            "Put all of the ingredients, except the sardines, into a bowl and mix together with some seasoning. Pour into a baking dish, add the sardines and toss really well. Cover and chill for a few hours.",
            "",
            "STEP 2",
            "",
            "Heat a BBQ or griddle pan until hot. Cook the sardines for 4-5 minutes on each side or until really caramelised and charred. Put onto a serving plate, drizzle with oil, sprinkle with a little more paprika and squeeze over the lemon wedges."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/lpd4wy1614347943.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=JYtMjKa6cdY",
        "tags": ["Misc"]
    },
    {
        "title": "Grilled eggplant with coconut milk",
        "category": "Vegetarian",
        "region": "Filipino",
        "ingList": [
            {
                "ing": "Egg Plants",
                "amount": "6"
            },
            {
                "ing": "Coconut Milk",
                "amount": "1 can "
            },
            {
                "ing": "Lemon Juice",
                "amount": "1 tbs"
            },
            {
                "ing": "Salt",
                "amount": "1 tsp "
            },
            {
                "ing": "Red Pepper Flakes",
                "amount": "To taste"
            },
            {
                "ing": "Onions",
                "amount": "4 Sticks"
            }
        ],
        "steps": [
            ".  Prepare the eggplants for grilling by pricking them all over with a fork.  This is so it won’t burst during the grilling process as the natural water in it heats up.",
            "2.  Grill the eggplants, turning them over frequently to ensure even cooking.  Grill until the skins are dark brown, even black and the eggplant is soft when you touch it.",
            "3.  Soak the grilled eggplant in a bowl of water to cool it down.  Peel the skin off the eggplant.  Place the whole eggplants in a shallow dish (my mom actually cuts the eggplant into small, bite-sized pieces).",
            " 4.  In a small mixing bowl, mix together the coconut milk or cream, lemon powder, salt and hot pepper.  Mix until the lemon powder and salt dissolve.  Taste, then adjust the amount of lemon powder, salt and hot pepper to your liking.  Pour the mixture over the eggplant.  Sprinkle the green onions over the eggplant and coconut milk.  Stir gently to combine. ",
            ""
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/bopa2i1683209167.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=ourC5IhljB4",
        "tags": ["Misc"]
    }
]
