[
    {
        "title": "Honey Teriyaki Salmon",
        "category": "Seafood",
        "region": "Japanese",
        "ingList": [
            {
                "ing": "Salmon",
                "amount": "1 lb"
            },
            {
                "ing": "Olive oil",
                "amount": "1 tablespoon"
            },
            {
                "ing": "Soy Sauce",
                "amount": "2 tablespoons"
            },
            {
                "ing": "Sake",
                "amount": "2 tablespoons"
            },
            {
                "ing": "Sesame Seed",
                "amount": "4 tablespoons"
            }
        ],
        "steps": [
            "Mix all the ingredients in the Honey Teriyaki Glaze together. Whisk to blend well. Combine the salmon and the Glaze together.",
            "",
            "Heat up a skillet on medium-low heat. Add the oil, Pan-fry the salmon on both sides until it’s completely cooked inside and the glaze thickens.",
            "",
            "Garnish with sesame and serve immediately."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/xxyupu1468262513.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=4MpYuaJsvRw",
        "tags": ["Fish", "Breakfast", "DateNight"]
    },
    {
        "title": "Hot Chocolate Fudge",
        "category": "Dessert",
        "region": "American",
        "ingList": [
            {
                "ing": "Chocolate Chips",
                "amount": "2 cups"
            },
            {
                "ing": "Heavy Cream",
                "amount": "2 tbs"
            },
            {
                "ing": "Condensed Milk",
                "amount": "1 – 14-ounce can"
            },
            {
                "ing": "Vanilla Extract",
                "amount": "1 tsp"
            },
            {
                "ing": "White Chocolate Chips",
                "amount": "1-⅓ cups"
            },
            {
                "ing": "Miniature Marshmallows",
                "amount": "1-½ cups"
            }
        ],
        "steps": [
            "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.",
            "In a microwave-safe bowl, combine the dark chocolate chips, heavy cream and half of the sweetened condensed milk. Microwave the dark chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.",
            "Add the vanilla extract to the dark chocolate mixture and stir well until smooth.",
            "Transfer the dark chocolate mixture into the prepared pan and spread into an even layer.",
            "In a separate bowl, combine the white chocolate chips with the remaining half of the sweetened condensed milk. Microwave the white chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.",
            "Evenly spread the white chocolate mixture on top of dark chocolate layer.",
            "Top the chocolate layers with the Mallow Bits or miniature marshmallows, and gently press them down.",
            "Refrigerate for 4 hours, or until set.",
            "Remove the fudge and wax paper from the pan. Carefully peel all of the wax paper from the fudge.",
            "Cut the fudge into bite-sized pieces and serve."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/xrysxr1483568462.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=oJvbsVSblfk",
        "tags": ["Snack", "Chocolate"]
    },
    {
        "title": "Hot and Sour Soup",
        "category": "Pork",
        "region": "Chinese",
        "ingList": [
            {
                "ing": "Mushrooms",
                "amount": "1/3 cup"
            },
            {
                "ing": "Wood Ear Mushrooms",
                "amount": "1/3 cup"
            },
            {
                "ing": "Tofu",
                "amount": "2/3 Cup"
            },
            {
                "ing": "Pork",
                "amount": "1/2 cup "
            },
            {
                "ing": "Chicken Stock",
                "amount": "2-1/2 cups"
            },
            {
                "ing": "Salt",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Sugar",
                "amount": "1/4 tsp"
            },
            {
                "ing": "Sesame Seed Oil",
                "amount": "1 tsp "
            },
            {
                "ing": "Pepper",
                "amount": "1/4 tsp"
            },
            {
                "ing": "Hotsauce",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Vinegar",
                "amount": "1-½ cups"
            },
            {
                "ing": "Soy Sauce",
                "amount": "1 tsp "
            },
            {
                "ing": "Cornstarch",
                "amount": "1 tbs"
            },
            {
                "ing": "Water",
                "amount": "2 tbs"
            },
            {
                "ing": "Spring Onions",
                "amount": "1/4 cup"
            }
        ],
        "steps": [
            "STEP 1 - MAKING THE SOUP",
            "In a wok add chicken broth and wait for it to boil.",
            "Next add salt, sugar, sesame seed oil, white pepper, hot pepper sauce, vinegar and soy sauce and stir for few seconds.",
            "Add Tofu, mushrooms, black wood ear mushrooms to the wok.",
            "To thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.",
            "Next add 1 egg slightly beaten with a knife or fork and add it to the soup and stir for 8 seconds",
            "Serve the soup in a bowl and add the bbq pork and sliced green onions on top."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/1529445893.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=KgV9Zq3aSTo",
        "tags": ["Soup"]
    },
    {
        "title": "Home-made Mandazi",
        "category": "Breakfast",
        "region": "Kenyan",
        "ingList": [
            {
                "ing": "Self-raising Flour",
                "amount": "750g"
            },
            {
                "ing": "Sugar",
                "amount": "6 tablespoons"
            },
            {
                "ing": "Eggs",
                "amount": "2"
            },
            {
                "ing": "Milk",
                "amount": "1 cup "
            }
        ],
        "steps": [
            "This is one recipe a lot of people have requested and I have tried to make it as simple as possible and I hope it will work for you. Make sure you use the right flour which is basically one with raising agents. Adjust the amount of sugar to your taste and try using different flavours to have variety whenever you have them.",
            "You can use Coconut milk instead of regular milk, you can also add desiccated coconut to the dry flour or other spices like powdered cloves or cinnamon.",
            "For “healthy looking” mandazis do not roll the dough too thin before frying and use the procedure I have indicated above.",
            "",
            "1. Mix the flour,cinnamon and sugar in a suitable bowl.",
            "2. In a separate bowl whisk the egg into the milk",
            "3. Make a well at the centre of the flour and add the milk and egg mixture and slowly mix to form a dough.",
            "4. Knead the dough for 3-4 minutes or until it stops sticking to the sides of the bowl and you have a smooth surface.",
            "5. Cover the dough with a damp cloth  and allow to rest for 15 minutes.",
            "6. Roll the dough on a lightly floured surface into a 1cm thick piece.",
            "7. Using a sharp small knife, cut the dough into the desired size setting aside ready for deep frying.",
            "8. Heat your oil in a suitable pot and gently dip the mandazi pieces to cook until light brown on the first side then turn to cook on the second side.",
            "9. Serve them warm or cold"
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/thazgm1555350962.jpg",
        "videoUrl": "",
        "tags": ["Baking", "Breakfast", "Egg", "Warm", "Snack"]
    },
    {
        "title": "Honey Balsamic Chicken with Crispy Broccoli & Potatoes",
        "category": "Chicken",
        "region": "American",
        "ingList": [
            {
                "ing": "Potatoes",
                "amount": "5"
            },
            {
                "ing": "Broccoli",
                "amount": "1"
            },
            {
                "ing": "Garlic",
                "amount": "2 cloves"
            },
            {
                "ing": "Chicken Breast",
                "amount": "2"
            },
            {
                "ing": "Balsamic Vinegar",
                "amount": " "
            },
            {
                "ing": "Honey",
                "amount": " "
            },
            {
                "ing": "Chicken Stock",
                "amount": " "
            },
            {
                "ing": "Butter",
                "amount": "1 tbsp"
            },
            {
                "ing": "Vegetable Oil",
                "amount": "1 tbsp"
            },
            {
                "ing": "Olive Oil",
                "amount": "1 tbsp"
            }
        ],
        "steps": [
            "2 Servings",
            "",
            "1. Preheat oven to 425 degrees. Wash and dry all produce. Cut potatoes into 1/2-inch-thick wedges. Toss on one side of a baking sheet with a drizzle of oil, salt, and pepper. (For 4 servings, spread potatoes out across entire sheet.) Roast on top rack for 5 minutes (we'll add the broccoli then). ",
            "",
            "2. Meanwhile, cut broccoli florets into bite-size pieces, if necessary. Peel and finely chop garlic. In a small microwave-safe bowl, combine 1 TBSP olive oil (2 TBSP for 4 servings) and half the garlic. Microwave until garlic sizzles, 30 seconds. ",
            "",
            "3. Once potatoes have roasted 5 minutes, remove sheet from oven and add broccoli to empty side; carefully toss with garlic oil, salt, and pepper. (For 4 servings, add broccoli to a second sheet.) Continue roasting until potatoes and broccoli are browned and crispy, 15-20 minutes more. ",
            "",
            "4. While veggies roast, pat chicken dry with paper towels; season all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. (If chicken browns too quickly, reduce heat to medium.) Turn off heat; set chicken aside to rest. Wash out pan. ",
            "",
            "5. Heat pan used for chicken over medium-high heat. Add a drizzle of oil and remaining garlic; cook until fragrant, 30 seconds. Stir in vinegar, honey, stock concentrate, and 1/4 cup water (1/3 cup for 4 servings). Simmer until thick and glossy, 2-3 minutes. Remove from heat and stir in 1 TBSP butter (2 TBSP for 4). Season with salt and pepper. ",
            "",
            "6. Return chicken to pan and turn to coat in glaze. Divide chicken, broccoli, and potatoes between plates. Spoon any remaining glaze over chicken and serve. "
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/kvbotn1581012881.jpg",
        "videoUrl": "",
        "tags": ["Misc"]
    },
    {
        "title": "Honey Yogurt Cheesecake",
        "category": "Dessert",
        "region": "Greek",
        "ingList": [
            {
                "ing": "Digestive Biscuits",
                "amount": "100g "
            },
            {
                "ing": "Almonds",
                "amount": "85g"
            },
            {
                "ing": "Butter",
                "amount": "85g"
            },
            {
                "ing": "Greek Yogurt",
                "amount": "250ml"
            },
            {
                "ing": "Mascarpone",
                "amount": "750g"
            },
            {
                "ing": "Eggs",
                "amount": "2"
            },
            {
                "ing": "Lemon",
                "amount": "Zest of 1"
            },
            {
                "ing": "Orange",
                "amount": "Zest of 1"
            },
            {
                "ing": "Honey",
                "amount": "250ml"
            },
            {
                "ing": "Fruit Mix",
                "amount": "To serve"
            }
        ],
        "steps": [
            "Heat oven to 160C/140C fan/gas 3. Crush the biscuits and most of the almonds inside a plastic food bag using a rolling pin. Mix with the butter, then press into the bottom of a deep, oval, 23cm dish (or something similar in size – a roasting tin, baking dish or cake tin will work). Bake for 10 mins until crisp.",
            "",
            "Stir or mash together the yogurt and mascarpone, then whisk in the eggs, one at a time. Stir in the lemon and orange zests, then stir in most of the honey, reserving about 3 tbsp. Spread over the biscuit base, cover loosely with foil and cook for 1 hr. Remove the foil and cook for 15 mins more until lightly golden and the top is firm with just the slightest wobble in the middle. Leave to cool. Can be kept in the fridge for up to 2 days.",
            "",
            "To serve, scatter with almonds, drizzle over the remaining honey, and hand around fresh fruit to go with it."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/y2irzl1585563479.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=JE8crtueXs8",
        "tags": ["Misc"]
    },
    {
        "title": "Ham hock colcannon",
        "category": "Pork",
        "region": "Irish",
        "ingList": [
            {
                "ing": "Floury Potatoes",
                "amount": "800g"
            },
            {
                "ing": "Butter",
                "amount": "50g"
            },
            {
                "ing": "Garlic Clove",
                "amount": "3 chopped"
            },
            {
                "ing": "Cabbage",
                "amount": "1 chopped"
            },
            {
                "ing": "Spring Onions",
                "amount": "8"
            },
            {
                "ing": "Double Cream",
                "amount": "100ml"
            },
            {
                "ing": "Mustard",
                "amount": "2 tbs"
            },
            {
                "ing": "Ham",
                "amount": "180g"
            },
            {
                "ing": "Eggs",
                "amount": "4"
            }
        ],
        "steps": [
            "STEP 1",
            "Peel and cut the potatoes into even, medium-sized chunks. Put in a large pan filled with cold salted water, bring to the boil and cook for 10-15 mins until a knife can be inserted into the potatoes easily.",
            "",
            "STEP 2",
            "Meanwhile, melt the butter in a large sauté pan over a medium heat. Add the garlic, cabbage, spring onions and some seasoning. Stir occasionally until the cabbage is wilted but still retains a little bite, then set aside.",
            "",
            "STEP 3",
            "Drain the potatoes, leave to steam-dry for a couple of mins, then mash with the cream, mustard and seasoning in the same saucepan. Stir in the cabbage and ham hock. Keep warm over a low heat.",
            "",
            "STEP 4",
            "Reheat the pan you used to cook the cabbage (no need to wash first), add a splash of oil, crack in the eggs and fry to your liking. To serve, divide the colcannon between bowls and top each with a fried egg."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/n41ny81608588066.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=aQJAU2iJ730",
        "tags": ["Misc"]
    }
]
