[{"title":"Jam Roly-Poly","category":"Dessert","region":"British","ingList":[{"ing":"Butter","amount":"50g"},{"ing":"Self-raising Flour","amount":"250g"},{"ing":"Vanilla","amount":"1 small"},{"ing":"Suet","amount":"50g"},{"ing":"Milk","amount":"150ml"},{"ing":"Raspberry Jam","amount":"100g "},{"ing":"Custard","amount":"to serve"}],"steps":["Put a deep roasting tin onto the bottom shelf of the oven, and make sure that there’s another shelf directly above it. Pull the roasting tin out on its shelf, fill two-thirds with boiling water from the kettle, then carefully slide it back in. Heat oven to 180C/160C fan/gas 4. Tear off a large sheet of foil and greaseproof paper (about 30 x 40cm). Sit the greaseproof on top of the foil and butter it.","Tip butter, flour and vanilla seeds into a food processor; pulse until the butter has disappeared. Tip into a mixing bowl. Stir through the suet, pour in the milk and work together with a cutlery knife until you get a sticky dough. You may need a drop more milk, depending on your flour.","Tip the dough out onto a floured surface, quickly pat together to smooth, then roll out to a square roughly 25 x 25cm. Spread the jam all over, leaving a gap along one edge, then roll up from the opposite edge. Pinch the jam-free edge into the dough where it meets, and pinch the ends roughly, too. Carefully lift onto the greased paper, join-side down (you might find a flat baking sheet helpful for this), loosely bring up the paper and foil around it, then scrunch together along the edges and ends to seal. The roly-poly will puff quite a bit during cooking so don’t wrap it tightly. Lift the parcel directly onto the rack above the tin and cook for 1 hr.","Let the pudding sit for 5 mins before unwrapping, then carefully open the foil and paper, and thickly slice to serve."],"imgUrl":"https://www.themealdb.com/images/media/meals/ysqupp1511640538.jpg","tags":["Misc"]},{"title":"Jerk chicken with rice & peas","category":"Chicken","region":"Jamaican","ingList":[{"ing":"Chicken Thighs","amount":"12"},{"ing":"Lime","amount":"1/2 "},{"ing":"Spring Onions","amount":"1  bunch"},{"ing":"Ginger","amount":"1 tbs chopped"},{"ing":"Garlic","amount":"3 cloves"},{"ing":"Onion","amount":"1/2 "},{"ing":"Red Chilli","amount":"3 chopped"},{"ing":"Thyme","amount":"1/2 teaspoon"},{"ing":"Lime","amount":"Juice of 1"},{"ing":"Soy Sauce","amount":"2 tbs"},{"ing":"Vegetable Oil","amount":"2 tbs"},{"ing":"Brown Sugar","amount":"3 tbs"},{"ing":"Allspice","amount":"1 tbs"},{"ing":"Basmati Rice","amount":"200g"},{"ing":"Coconut Milk","amount":"400g"},{"ing":"Spring Onions","amount":"1  bunch"},{"ing":"Thyme","amount":"2 sprigs"},{"ing":"Garlic","amount":"2 cloves chopped"},{"ing":"Allspice","amount":"1 tbs"},{"ing":"Kidney Beans","amount":"800g"}],"steps":["To make the jerk marinade, combine all the ingredients in a food processor along with 1 tsp salt, and blend to a purée. If you’re having trouble getting it to blend, just keep turning off the blender, stirring the mixture, and trying again. Eventually it will start to blend up – don’t be tempted to add water, as you want a thick paste.","","Taste the jerk mixture for seasoning – it should taste pretty salty, but not unpleasantly, puckering salty. You can now throw in more chillies if it’s not spicy enough for you. If it tastes too salty and sour, try adding in a bit more brown sugar until the mixture tastes well balanced.","","Make a few slashes in the chicken thighs and pour the marinade over the meat, rubbing it into all the crevices. Cover and leave to marinate overnight in the fridge.","","If you want to barbecue your chicken, get the coals burning 1 hr or so before you’re ready to cook. Authentic jerked meats are not exactly grilled as we think of grilling, but sort of smoke-grilled. To get a more authentic jerk experience, add some wood chips to your barbecue, and cook your chicken over slow, indirect heat for 30 mins. To cook in the oven, heat to 180C/160C fan/gas 4. Put the chicken pieces in a roasting tin with the lime halves and cook for 45 mins until tender and cooked through.","","While the chicken is cooking, prepare the rice & peas. Rinse the rice in plenty of cold water, then tip it into a large saucepan with all the remaining ingredients except the kidney beans. Season with salt, add 300ml cold water and set over a high heat. Once the rice begins to boil, turn it down to a medium heat, cover and cook for 10 mins.","","Add the beans to the rice, then cover with a lid. Leave off the heat for 5 mins until all the liquid is absorbed. Squeeze the roasted lime over the chicken and serve with the rice & peas, and some hot sauce if you like it really spicy."],"imgUrl":"https://www.themealdb.com/images/media/meals/tytyxu1515363282.jpg","tags":["Chilli","Curry"]},{"title":"Jamaican Beef Patties","category":"Beef","region":"Jamaican","ingList":[{"ing":"Plain Flour","amount":"4 cups "},{"ing":"Salt","amount":"1 tsp "},{"ing":"Curry Powder","amount":"1 tsp "},{"ing":"Butter","amount":"250g"},{"ing":"Water","amount":"1 cup "},{"ing":"Minced Beef","amount":"900g"},{"ing":"Allspice","amount":"1 tsp "},{"ing":"Black Pepper","amount":"1/2 tsp"},{"ing":"Vegetable Oil","amount":"2 tbs"},{"ing":"Onions","amount":"1 cup "},{"ing":"Red Pepper","amount":"Ground"},{"ing":"Garlic","amount":"2 tsp ground"},{"ing":"Thyme","amount":"1 tbs"},{"ing":"Salt","amount":"1/4 tsp"},{"ing":"Tomato Ketchup","amount":"2 tbs"},{"ing":"Water","amount":"2 cups "},{"ing":"Onions","amount":"1/2 cup "},{"ing":"Egg","amount":"1 beaten"},{"ing":"Water","amount":"1 tbs"},{"ing":"Water","amount":"1/4 cup"}],"steps":["Make the Pastry Dough","","To a large bowl, add flour, 1 teaspoon salt, and turmeric and mix thoroughly.","Rub shortening into flour until there are small pieces of shortening completely covered with flour.","Pour in 1/2 cup of the ice water and mix with your hands to bring the dough together. Keep adding ice water 2 to 3 tablespoons at a time until the mixture forms a dough.","At this stage, you can cut the dough into 2 large pieces, wrap in plastic and refrigerate for 30 minutes before using it.","Alternatively, cut the dough into 10 to 12 equal pieces, place on a platter or baking sheet, cover securely with plastic wrap and let chill for 30 minutes while you make the filling.","Make the Filling","","Add ground beef to a large bowl. Sprinkle in allspice and black pepper. Mix together and set aside.","Heat oil in a skillet until hot.","Add onions and sauté until translucent. Add hot pepper, garlic and thyme and continue to sauté for another minute. Add 1/4 teaspoon salt.","Add seasoned ground beef and toss to mix, breaking up any clumps, and let cook until the meat is no longer pink.","Add ketchup and more salt to taste.","Pour in 2 cups of water and stir. Bring the mixture to a boil then reduce heat and let simmer until most of the liquid has evaporated and whatever is remaining has reduced to a thick sauce.","Fold in green onions. Remove from heat and let cool completely.","Assemble the Patties","","Beat the egg and water together to make an egg wash. Set aside.","Now you can prepare the dough in two ways.","First Method: Flour the work surface and rolling pin. If you had cut it into 2 large pieces, then take one of the large pieces and roll it out into a very large circle. Take a bowl with a wide rim (about 5 inches) and cut out three circles.","","Place about 3 heaping tablespoons of the filling onto 1/2 of each circle. Dip a finger into the water and moisten the edges of the pastry. Fold over the other half and press to seal. ","","Take a fork and crimp the edges. Cut off any extra to make it look neat and uniform. Place on a parchment-lined baking sheet and continue to work until you have rolled all the dough and filled the patties.","Second Method: If you had pre-cut the dough into individual pieces, work with one piece of dough at a time. Roll it out on a floured surface into a 5-inch circle or a little larger. Don’t worry if the edges are not perfect.","","Place 3 heaping tablespoons of the filling on one side of the circle. Dip a finger into the water and moisten the edges of the pastry. Fold over the other half and press to seal.","","Take a fork and crimp the edges. Cut off any extra to make it look neat and uniform. Place on a parchment-lined baking sheet and continue work until you have rolled all the dough and filled the patties.","","Frying and Serving the Patties","","After forming the patties, place the pans in the refrigerator while you heat the oven to 350 F.","Just before adding the pans with the patties to the oven, brush the patties with egg wash.","Bake patties for 30 minutes or until golden brown.","Cool on wire racks.","Serve warm."],"imgUrl":"https://www.themealdb.com/images/media/meals/wsqqsw1515364068.jpg","tags":["Snack","Spicy"]},{"title":"Japanese gohan rice","category":"Side","region":"Japanese","ingList":[{"ing":"Sushi Rice","amount":"300g"},{"ing":"Mirin","amount":"1 tbs"},{"ing":"Pickle Juice","amount":"Garnish"},{"ing":"Spring Onions","amount":"Garnish"}],"steps":["STEP 1","Rinsing and soaking your rice is key to achieving the perfect texture. Measure the rice into a bowl, cover with cold water, then use your fingers to massage the grains of rice – the water will become cloudy. Drain and rinse again with fresh water. Repeat five more times until the water stays clear.","","STEP 2","Tip the rinsed rice into a saucepan with 400ml water, or 200ml dashi and 200ml water, bring to the boil, then turn down the heat to a low simmer, cover with a tight-fitting lid with a steam hole and cook for 15 mins. Remove from the heat and leave to sit for another 15 mins, then stir through the mirin. Remove the lid and give it a good stir. Serve with any or all of the optional toppings."],"imgUrl":"https://www.themealdb.com/images/media/meals/kw92t41604181871.jpg","tags":["Misc"]},{"title":"Japanese Katsudon","category":"Pork","region":"Japanese","ingList":[{"ing":"Vegetable Oil","amount":"1 tbs"},{"ing":"Onion","amount":"1 large"},{"ing":"Pork","amount":"1 chopped"},{"ing":"Vegetable Stock","amount":"150ml"},{"ing":"Soy Sauce","amount":"1 tbs"},{"ing":"Mirin","amount":"1 tsp "},{"ing":"Sugar","amount":"1 tsp "},{"ing":"Eggs","amount":"2 Beaten "},{"ing":"Sushi Rice","amount":"200g"},{"ing":"Chives","amount":"Chopped"}],"steps":["STEP 1","Heat the oil in a pan, fry the sliced onion until golden brown, then add the tonkatsu (see recipe here), placing it in the middle of the pan. Mix the dashi, soy, mirin and sugar together and tip three-quarters of the mixture around the tonkatsu. Sizzle for a couple of mins so the sauce thickens a little and the tonkatsu reheats.","","STEP 2","Tip the beaten eggs around the tonkatsu and cook for 2-3 mins until the egg is cooked through but still a little runny. Divide the rice between two bowls, then top each with half the egg and tonkatsu mix, sprinkle over the chives and serve immediately, drizzling with a little more soy if you want an extra umami kick."],"imgUrl":"https://www.themealdb.com/images/media/meals/d8f6qx1604182128.jpg","tags":["Misc"]}]