[{"title":"Lamb tomato and sweet spices","category":"Lamb","region":"Moroccan","ingList":[{"ing":"olive oil","amount":"2 tbsp"},{"ing":"ginger","amount":"4cm piece finely chopped"},{"ing":"garlic","amount":"2 cloves peeled and chopped"},{"ing":"tomatoes","amount":"800g peeled and chopped "},{"ing":"lemon juice","amount":"2 tbsp"},{"ing":"caster sugar","amount":"1 tsp"},{"ing":"vine leaves","amount":"50"},{"ing":"fennel bulb","amount":"1 large"},{"ing":"lamb mince","amount":"400g"},{"ing":"onion","amount":"1 medium"},{"ing":"potato","amount":"1 small peeled and coarsely grated"},{"ing":"basmati rice","amount":"2 tbsp"},{"ing":"chopped parsley","amount":"2 tbsp"},{"ing":"coriander","amount":"2 tbsp chopped"},{"ing":"lemon juice","amount":"1 tbsp"},{"ing":"garlic","amount":"2 cloves"},{"ing":"clove","amount":"½ tsp ground"},{"ing":"cinnamon","amount":"½ tsp ground "},{"ing":"tomatoes","amount":"2 medium"}],"steps":["Use pickled vine leaves here, preserved in brine. Small delicate leaves are better than the large bristly ones but, if only large leaves are to hand, then trim them to roughly 12 by 12 cms so that you don't get too many layers of leaves around the filling. And remove any stalks. Drain the preserved leaves, immerse them in boiling water for 10 minutes and then leave to dry on a tea towel before use. ","Basmati rice with butter and pine nuts is an ideal accompaniment. Couscous is great, too. Serves four.","First make the filling. Put all the ingredients, apart from the tomatoes, in a bowl. Cut the tomatoes in half, coarsely grate into the bowl and discard the skins. Add half a teaspoon of salt and some black pepper, and stir. Leave on the side, or in the fridge, for up to a day. Before using, gently squeeze with your hands and drain away any juices that come out.","To make the sauce, heat the oil in a medium pan. Add the ginger and garlic, cook for a minute or two, taking care not to burn them, then add the tomato, lemon juice and sugar. Season, and simmer for 20 minutes.","While the sauce is bubbling away, prepare the vine leaves. Use any torn or broken leaves to line the base of a wide, heavy saucepan. Trim any leaves from the fennel, cut it vertically into 0.5cm-thick slices and spread over the base of the pan to cover completely.","Lay a prepared vine leaf (see intro) on a work surface, veiny side up. Put two teaspoons of filling at the base of the leaf in a 2cm-long by 1cm-wide strip. Fold the sides of the leaf over the filling, then roll it tightly from bottom to top, in a cigar shape. Place in the pan, seam down, and repeat with the remaining leaves, placing them tightly next to each other in lines or circles (in two layers if necessary).","Pour the sauce over the leaves (and, if needed, add water just to cover). Place a plate on top, to weigh the leaves down, then cover with a lid. Bring to a boil, reduce the heat and cook on a bare simmer for 70 minutes. Most of the liquid should evaporate. Remove from the heat, and leave to cool a little - they are best served warm. When serving, bring to the table in the pan - it looks great. Serve a few vine leaves and fennel slices with warm rice. Spoon the braising juices on top and garnish with coriander."],"imgUrl":"https://www.themealdb.com/images/media/meals/qtwtss1468572261.jpg","tags":["Misc"]},{"title":"Lamb Biryani","category":"Lamb","region":"Indian","ingList":[{"ing":"Cashew nuts","amount":"12"},{"ing":"Khus khus","amount":"½ tbsp"},{"ing":"Cumin seeds","amount":"½ tbsp"},{"ing":"Onions","amount":"3 sliced thinly"},{"ing":"Ginger garlic paste","amount":"2 tsp"},{"ing":"Garlic","amount":"4 whole"},{"ing":"Mint","amount":"Leaves"},{"ing":"Cilantro","amount":"Leaves"},{"ing":"Saffron","amount":"½ tsp dissolved in ½ cup warm milk"},{"ing":"Ghee","amount":"2 tbsp"},{"ing":"Basmati rice","amount":"2 Cups"},{"ing":"Full fat yogurt","amount":"½ cup"},{"ing":"Cumin Seeds","amount":"1 tbsp"},{"ing":"Bay leaf","amount":"½"},{"ing":"Cinnamon","amount":"1 thin piece"},{"ing":"Cloves","amount":"3"},{"ing":"Cardamom","amount":"2"},{"ing":"Lamb","amount":"1 lb"},{"ing":"Red Chilli powder","amount":"1 tsp"},{"ing":"Biryani masala","amount":"1 tbsp"}],"steps":["Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible. Set aside. ","","Deep fry the sliced onions when it is hot. Don’t overcrowd the oil. When the onions turn light brown, remove from oil and drain on paper towel. The fried onion will crisp up as it drains. Also fry the cashewnuts till golden brown. Set aside.","","Wash the rice and soak in water for twenty minutes.","Meanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.","Then add the tomatoes and sauté them well till they are cooked and not mushy.","","Then to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.","Add the yogurt and mix well. I always move the skillet away from the heat when adding yogurt which prevents it from curdling.","","Now after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well. Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles. If the water is not drained totally, heat it by keeping it open.","","Take another big pan, add thrice the cup of rice you use, and boil it. When it is boiling high, add the rice, salt and jeera and mix well. After 7 minutes exact or when the rice is 80% done. Switch off and drain the rice.","","Now, the layering starts. To the lamb, pat and level it. Add the drained hot rice on the top of it. Garnish with fried onions, ghee, mint, coriander leaves and saffron dissolved in milk.","","Cover the dish and bake in a 350f oven for 15 minutes or till the cooked but not mushy. Or cook in the stove medium heat for 12 minutes and lowest heat for 5 minutes. And switch off. Mix and serve hot!","Notes","1. If you are cooking in oven, do make sure to cook in a big oven safe pan and cover it tight and then keep in oven for the final step.","2. You can skip biryani masala if you don’t have and add just garam masala (1 tsp and red chilli powder – 3 tsp instead of 1 tsp)","3. If it is spicy in the end, squeeze some lemon, it will reduce the heat and enhance the flavors also."],"imgUrl":"https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg","tags":["Curry","Meat"]},{"title":"Lamb Rogan josh","category":"Lamb","region":"Indian","ingList":[{"ing":"Onion","amount":"2 quartered"},{"ing":"Sunflower Oil","amount":"4 tbsp"},{"ing":"Garlic","amount":"4 cloves"},{"ing":"Ginger","amount":"Thumb sized peeled and very finely grated"},{"ing":"Madras Paste","amount":"2 tbsp"},{"ing":"Paprika","amount":"2 tsp"},{"ing":"cinnamon stick","amount":"1"},{"ing":"Cardamom","amount":"6 bashed to break shells"},{"ing":"Clove","amount":"4"},{"ing":"Bay Leaf","amount":"2"},{"ing":"Tomato Purée","amount":"1 tbsp"},{"ing":"Lamb","amount":"1kg cubed"},{"ing":"Greek yogurt","amount":"150ml"},{"ing":"Coriander","amount":"Garnish chopped "}],"steps":["","Put the onions in a food processor and whizz until very finely chopped. Heat the oil in a large heavy-based pan, then fry the onion with the lid on, stirring every now and then, until it is really golden and soft. Add the garlic and ginger, then fry for 5 mins more.","Tip the curry paste, all the spices and the bay leaves into the pan, with the tomato purée. Stir well over the heat for about 30 secs, then add the meat and 300ml water. Stir to mix, turn down the heat, then add the yogurt.","Cover the pan, then gently simmer for 40-60 mins until the meat is tender and the sauce nice and thick. Serve scattered with coriander, with plain basmati or pilau rice."],"imgUrl":"https://www.themealdb.com/images/media/meals/vvstvq1487342592.jpg","tags":["Curry","Spicy","Alcoholic"]},{"title":"Laksa King Prawn Noodles","category":"Seafood","region":"Malaysian","ingList":[{"ing":"Olive Oil","amount":"1 tbsp"},{"ing":"red chili","amount":"1 finely sliced"},{"ing":"Thai red curry paste","amount":"2 ½ tbsp"},{"ing":"vegetable stock cube","amount":"1"},{"ing":"coconut milk","amount":"400ml can"},{"ing":"fish sauce","amount":"2 tsp"},{"ing":"rice noodles","amount":"100g"},{"ing":"lime","amount":"2 juice of 1, the other halved"},{"ing":"king prawns","amount":"150g"},{"ing":"coriander","amount":"½ small pack"}],"steps":["Heat the oil in a medium saucepan and add the chilli. Cook for 1 min, then add the curry paste, stir and cook for 1 min more. Dissolve the stock cube in a large jug in 700ml boiling water, then pour into the pan and stir to combine. Tip in the coconut milk and bring to the boil.","Add the fish sauce and a little seasoning. Toss in the noodles and cook for a further 3-4 mins until softening. Squeeze in the lime juice, add the prawns and cook through until warm, about 2-3 mins. Scatter over some of the coriander.","Serve in bowls with the remaining coriander and lime wedges on top for squeezing over."],"imgUrl":"https://www.themealdb.com/images/media/meals/rvypwy1503069308.jpg","tags":["Shellfish","Seafood"]},{"title":"Lamb Tagine","category":"Lamb","region":"Moroccan","ingList":[{"ing":"Olive Oil","amount":"2 tblsp "},{"ing":"Onion","amount":"1 finely sliced"},{"ing":"Carrots","amount":"2 chopped"},{"ing":"Lamb Leg","amount":"500g"},{"ing":"Garlic","amount":"2 cloves minced"},{"ing":"Cumin","amount":"½ tsp"},{"ing":"Ginger","amount":"½ tsp"},{"ing":"Saffron","amount":"¼ tsp"},{"ing":"Cinnamon","amount":"1 tsp "},{"ing":"Honey","amount":"1 tblsp "},{"ing":"Apricot","amount":"100g "},{"ing":"Vegetable Stock Cube","amount":"1"},{"ing":"Butternut Squash","amount":"1 medium chopped"},{"ing":"Couscous","amount":"Steamed"},{"ing":"Parsley","amount":"Chopped"}],"steps":["Heat the olive oil in a heavy-based pan and add the onion and carrot. Cook for 3- 4 mins until softened.","","Add the diced lamb and brown all over. Stir in the garlic and all the spices and cook for a few mins more or until the aromas are released.","","Add the honey and apricots, crumble in the stock cube and pour over roughly 500ml boiling water or enough to cover the meat. Give it a good stir and bring to the boil. Turn down to a simmer, put the lid on and cook for 1 hour.","","Remove the lid and cook for a further 30 mins, then stir in the squash. Cook for 20 – 30 mins more until the squash is soft and the lamb is tender. Serve alongside rice or couscous and sprinkle with parsley and pine nuts, if using."],"imgUrl":"https://www.themealdb.com/images/media/meals/yuwtuu1511295751.jpg","tags":["Misc"]},{"title":"Lasagne","category":"Pasta","region":"Italian","ingList":[{"ing":"Olive Oil","amount":"1 tblsp "},{"ing":"Bacon","amount":"2"},{"ing":"Onion","amount":"1 finely chopped "},{"ing":"Celery","amount":"1 Stick"},{"ing":"Carrots","amount":"1 medium"},{"ing":"Garlic","amount":"2 cloves chopped"},{"ing":"Minced Beef","amount":"500g"},{"ing":"Tomato Puree","amount":"1 tbls"},{"ing":"Chopped Tomatoes","amount":"800g"},{"ing":"Honey","amount":"1 tblsp "},{"ing":"Lasagne Sheets","amount":"500g"},{"ing":"Creme Fraiche","amount":"400ml"},{"ing":"Mozzarella Balls","amount":"125g"},{"ing":"Parmesan Cheese","amount":"50g"},{"ing":"Basil Leaves","amount":"Topping"}],"steps":["Heat the oil in a large saucepan. Use kitchen scissors to snip the bacon into small pieces, or use a sharp knife to chop it on a chopping board. Add the bacon to the pan and cook for just a few mins until starting to turn golden. Add the onion, celery and carrot, and cook over a medium heat for 5 mins, stirring occasionally, until softened.","Add the garlic and cook for 1 min, then tip in the mince and cook, stirring and breaking it up with a wooden spoon, for about 6 mins until browned all over.","Stir in the tomato purée and cook for 1 min, mixing in well with the beef and vegetables. Tip in the chopped tomatoes. Fill each can half full with water to rinse out any tomatoes left in the can, and add to the pan. Add the honey and season to taste. Simmer for 20 mins.","Heat oven to 200C/180C fan/gas 6. To assemble the lasagne, ladle a little of the ragu sauce into the bottom of the roasting tin or casserole dish, spreading the sauce all over the base. Place 2 sheets of lasagne on top of the sauce overlapping to make it fit, then repeat with more sauce and another layer of pasta. Repeat with a further 2 layers of sauce and pasta, finishing with a layer of pasta.","Put the crème fraîche in a bowl and mix with 2 tbsp water to loosen it and make a smooth pourable sauce. Pour this over the top of the pasta, then top with the mozzarella. Sprinkle Parmesan over the top and bake for 25–30 mins until golden and bubbling. Serve scattered with basil, if you like."],"imgUrl":"https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg","tags":["Misc"]},{"title":"Lamb and Potato pie","category":"Lamb","region":"British","ingList":[{"ing":"Lamb Shoulder","amount":"500g"},{"ing":"Flour","amount":"1 tbls"},{"ing":"Vegetable Oil","amount":"Dash"},{"ing":"Onion","amount":"1 sliced"},{"ing":"Carrots","amount":"2 sliced"},{"ing":"Vegetable Stock","amount":"350ml/12fl"},{"ing":"Potatoes","amount":"500g"},{"ing":"Shortcrust Pastry","amount":"450g"},{"ing":"Eggs","amount":"To Glaze"}],"steps":["Dust the meat with flour to lightly coat.","Heat enough vegetable oil in a large saucepan to fill the base, and fry the onion and meat until lightly browned. Season with salt and pepper.","Add the carrots, stock and more seasoning to taste.","Bring to the boil, cover and reduce the heat to a simmer. Simmer for at least an hour or until the meat is tender. Take your time cooking the meat, the longer you leave it to cook, the better the flavour will be.","Preheat the oven to 180C/350F/Gas 4.","Add the drained potato cubes to the lamb.","Turn the mixture into a pie dish or casserole and cover with the shortcrust pastry. Make three slits in the top of the pastry to release any steam while cooking.","Brush with beaten egg and bake for about 40 minutes, until the pastry is golden brown.","Serve."],"imgUrl":"https://www.themealdb.com/images/media/meals/sxrpws1511555907.jpg","tags":["Pie"]},{"title":"Lancashire hotpot","category":"Lamb","region":"British","ingList":[{"ing":"Butter","amount":"100g "},{"ing":"Lamb","amount":"900g"},{"ing":"Lamb Kidney","amount":"3"},{"ing":"Onions","amount":"2 medium"},{"ing":"Carrots","amount":"4 sliced"},{"ing":"Plain Flour","amount":"25g"},{"ing":"Worcestershire Sauce","amount":"2 tsp"},{"ing":"Chicken Stock","amount":"500ml"},{"ing":"Bay Leaves","amount":"2"},{"ing":"Potatoes","amount":"900g"}],"steps":["Heat oven to 160C/fan 140C/gas 3. Heat some dripping or butter in a large shallow casserole dish, brown the lamb in batches, lift to a plate, then repeat with the kidneys.","Fry the onions and carrots in the pan with a little more dripping until golden. Sprinkle over the flour, allow to cook for a couple of mins, shake over the Worcestershire sauce, pour in the stock, then bring to the boil. Stir in the meat and bay leaves, then turn off the heat. Arrange the sliced potatoes on top of the meat, then drizzle with a little more dripping. Cover, then place in the oven for about 1½ hrs until the potatoes are cooked.","Remove the lid, brush the potatoes with a little more dripping, then turn the oven up to brown the potatoes, or finish under the grill for 5-8 mins until brown."],"imgUrl":"https://www.themealdb.com/images/media/meals/uttrxw1511637813.jpg","tags":["Misc"]},{"title":"Leblebi Soup","category":"Vegetarian","region":"Tunisian","ingList":[{"ing":"Olive Oil","amount":"2 tbs"},{"ing":"Onion","amount":"1 medium finely diced"},{"ing":"Chickpeas","amount":"250g"},{"ing":"Vegetable Stock","amount":"1.5L"},{"ing":"Cumin","amount":"1 tsp "},{"ing":"Garlic","amount":"5 cloves"},{"ing":"Salt","amount":"1/2 tsp"},{"ing":"Harissa Spice","amount":"1 tsp "},{"ing":"Pepper","amount":"Pinch"},{"ing":"Lime","amount":"1/2 "}],"steps":["Heat the oil in a large pot. Add the onion and cook until translucent.","Drain the soaked chickpeas and add them to the pot together with the vegetable stock. Bring to the boil, then reduce the heat and cover. Simmer for 30 minutes.","In the meantime toast the cumin in a small ungreased frying pan, then grind them in a mortar. Add the garlic and salt and pound to a fine paste.","Add the paste and the harissa to the soup and simmer until the chickpeas are tender, about 30 minutes.","Season to taste with salt, pepper and lemon juice and serve hot."],"imgUrl":"https://www.themealdb.com/images/media/meals/x2fw9e1560460636.jpg","tags":["Soup"]},{"title":"Lasagna Sandwiches","category":"Pasta","region":"American","ingList":[{"ing":"Sour Cream","amount":"1/4 cup"},{"ing":"Chopped Onion","amount":"2 tbs"},{"ing":"Dried Oregano","amount":"1/2 tbs"},{"ing":"Salt","amount":"1/4 tsp"},{"ing":"Bread","amount":"8 slices"},{"ing":"Bacon","amount":"8 slices"},{"ing":"Tomato","amount":"8 slices"},{"ing":"Mozzarella","amount":"4 slices"},{"ing":"Butter","amount":"2 1/2 Tbs"}],"steps":["1. In a small bowl, combine the first four ingredients; spread on four slices of bread. Layer with bacon, tomato and cheese; top with remaining bread.","","2. In a large skillet or griddle, melt 2 tablespoons butter. Toast sandwiches until lightly browned on both sides and cheese is melted, adding butter if necessary.","","Nutrition Facts","1 sandwich: 445 calories, 24g fat (12g saturated fat), 66mg cholesterol, 1094mg sodium, 35g carbohydrate (3g sugars, 2g fiber), 21g protein."],"imgUrl":"https://www.themealdb.com/images/media/meals/xr0n4r1576788363.jpg","tags":["Sandwich"]},{"title":"Lamb and Lemon Souvlaki","category":"Lamb","region":"Greek","ingList":[{"ing":"Garlic","amount":"2 cloves"},{"ing":"Sea Salt","amount":"2 tsp"},{"ing":"Olive Oil","amount":"4 tbs"},{"ing":"Lemon","amount":"Zest and juice of 1"},{"ing":"Dill","amount":"1 tbs"},{"ing":"Lamb Leg","amount":"750g"},{"ing":"Pita Bread","amount":"To serve"}],"steps":["Pound the garlic with sea salt in a pestle and mortar (or use a small food processor), until the garlic forms a paste. Whisk together the oil, lemon juice, zest, dill and garlic. Mix in the lamb and combine well. Cover and marinate for at least 2 hrs or overnight in the fridge. If you’re going to use bamboo skewers, soak them in cold water.","","If you’ve prepared the lamb the previous day, take it out of the fridge 30 mins before cooking. Thread the meat onto the soaked or metal skewers. Heat the grill to high or have a hot griddle pan or barbecue ready. Cook the skewers for 2-3 mins on each side, basting with the remaining marinade. Heat the pitta or flatbreads briefly, then stuff with the souvlaki. Add Greek salad (see 'Goes well with', right) and Tzatziki (below), if you like."],"imgUrl":"https://www.themealdb.com/images/media/meals/rjhf741585564676.jpg","tags":["Misc"]},{"title":"Lamb Tzatziki Burgers","category":"Lamb","region":"Greek","ingList":[{"ing":"Bulgur Wheat","amount":"25g"},{"ing":"Lamb Mince","amount":"500g"},{"ing":"Cumin","amount":"1 tsp "},{"ing":"Coriander","amount":"1 tsp "},{"ing":"Paprika","amount":"1 tsp "},{"ing":"Garlic","amount":"1 clove finely chopped"},{"ing":"Olive Oil","amount":"For frying"},{"ing":"Bun","amount":"4"},{"ing":"Cucumber","amount":"Grated"},{"ing":"Greek Yogurt","amount":"200g"},{"ing":"Mint","amount":"2 tbs"}],"steps":["Tip the bulghar into a pan, cover with water and boil for 10 mins. Drain really well in a sieve, pressing out any excess water.","","To make the tzatziki, squeeze and discard the juice from the cucumber, then mix into the yogurt with the chopped mint and a little salt.","","Work the bulghar into the lamb with the spices, garlic (if using) and seasoning, then shape into 4 burgers. Brush with a little oil and fry or barbecue for about 5 mins each side until cooked all the way through. Serve in the buns (toasted if you like) with the tzatziki, tomatoes, onion and a few mint leaves."],"imgUrl":"https://www.themealdb.com/images/media/meals/k420tj1585565244.jpg","tags":["Misc"]},{"title":"Lamb Pilaf (Plov)","category":"Lamb","region":"Russian","ingList":[{"ing":"Lamb","amount":"50g"},{"ing":"Prunes","amount":"120g"},{"ing":"Lemon Juice","amount":"1 tbs"},{"ing":"Butter","amount":"2 tbs"},{"ing":"Onion","amount":"1 chopped"},{"ing":"Lamb","amount":"450g"},{"ing":"Garlic","amount":"2 cloves"},{"ing":"Vegetable Stock","amount":"600ml"},{"ing":"Rice","amount":"2 cups "},{"ing":"Saffron","amount":"Pinch"},{"ing":"Parsley","amount":"Garnish"}],"steps":["Place the raisins and prunes into a small bowl and pour over enough water to cover. Add lemon juice and let soak for at least 1 hour. Drain. Roughly chop the prunes.","","Meanwhile, heat the butter in a large pan, add the onion, and cook for 5 minutes. Add cubed lamb, ground lamb, and crushed garlic cloves. Fry for 5 minutes, stirring constantly until browned.","","Pour 2/3 cup (150 milliliters) of stock into the pan. Bring to a boil, then lower the heat, cover, and simmer for 1 hour, or until the lamb is tender.","","Add the remaining stock and bring to a boil. Add rinsed long-grain white rice and a large pinch of saffron. Stir, then cover, and simmer for 15 minutes, or until the rice is tender.","","Add the drained raisins, drained chopped prunes, and salt and pepper to taste. Heat through for a few minutes, then turn out onto a warmed serving dish and garnish with sprigs of flat-leaf parsley."],"imgUrl":"https://www.themealdb.com/images/media/meals/kos9av1699014767.jpg","tags":["rice"]}]