[
    {
        "title": "Mediterranean Pasta Salad",
        "category": "Seafood",
        "region": "Italian",
        "ingList": [
            {
                "ing": "mozzarella balls",
                "amount": "200 g"
            },
            {
                "ing": "baby plum tomatoes",
                "amount": "250 g"
            },
            {
                "ing": "fresh basil",
                "amount": "1  bunch"
            },
            {
                "ing": "farfalle",
                "amount": "350 g"
            },
            {
                "ing": "extra virgin olive oil",
                "amount": "3  tablespoons"
            },
            {
                "ing": "Green Olives",
                "amount": "40 g"
            },
            {
                "ing": "tuna",
                "amount": "200 g"
            },
            {
                "ing": "salt",
                "amount": "to taste"
            },
            {
                "ing": "pepper",
                "amount": "to taste"
            }
        ],
        "steps": [
            "Bring a large saucepan of salted water to the boil",
            "Add the pasta, stir once and cook for about 10 minutes or as directed on the packet.",
            "Meanwhile, wash the tomatoes and cut into quarters. Slice the olives. Wash the basil.",
            "Put the tomatoes into a salad bowl and tear the basil leaves over them. Add a tablespoon of olive oil and mix.",
            "When the pasta is ready, drain into a colander and run cold water over it to cool it quickly.",
            "Toss the pasta into the salad bowl with the tomatoes and basil.",
            "Add the sliced olives, drained mozzarella balls, and chunks of tuna. Mix well and let the salad rest for at least half an hour to allow the flavours to mingle.",
            "Sprinkle the pasta with a generous grind of black pepper and drizzle with the remaining olive oil just before serving."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/wvqpwt1468339226.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=e52IL8zYmaE",
        "tags": ["Pasta", "Baking"]
    },
    {
        "title": "Massaman Beef curry",
        "category": "Beef",
        "region": "Thai",
        "ingList": [
            {
                "ing": "Peanuts",
                "amount": "85g"
            },
            {
                "ing": "Coconut cream",
                "amount": "400ml can"
            },
            {
                "ing": "Massaman curry paste",
                "amount": "4 tbsp"
            },
            {
                "ing": "Beef",
                "amount": "600g stewing cut into strips"
            },
            {
                "ing": "Potatoes",
                "amount": "450g waxy"
            },
            {
                "ing": "Onion",
                "amount": "1 cut thin wedges"
            },
            {
                "ing": "Lime",
                "amount": "4 leaves"
            },
            {
                "ing": "Cinnamon stick",
                "amount": "1"
            },
            {
                "ing": "Tamarind paste",
                "amount": "1 tbsp"
            },
            {
                "ing": "Brown sugar",
                "amount": "1 tbsp palm or soft light"
            },
            {
                "ing": "Fish Sauce",
                "amount": "1 tbsp"
            },
            {
                "ing": "chilli",
                "amount": "1 red deseeded and finely sliced, to serve"
            },
            {
                "ing": "Jasmine Rice",
                "amount": "to serve"
            }
        ],
        "steps": [
            "Heat oven to 200C/180C fan/gas 6, then roast the peanuts on a baking tray for 5 mins until golden brown. When cool enough to handle, roughly chop. Reduce oven to 180C/160C fan/gas 4.",
            "Heat 2 tbsp coconut cream in a large casserole dish with a lid. Add the curry paste and fry for 1 min, then stir in the beef and fry until well coated and sealed. Stir in the rest of the coconut with half a can of water, the potatoes, onion, lime leaves, cinnamon, tamarind, sugar, fish sauce and most of the peanuts. Bring to a simmer, then cover and cook for 2 hrs in the oven until the beef is tender.",
            "Sprinkle with sliced chilli and the remaining peanuts, then serve straight from the dish with jasmine rice."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=mVxgZSCU9_g",
        "tags": ["Curry"]
    },
    {
        "title": "Mushroom & Chestnut Rotolo",
        "category": "Vegetarian",
        "region": "British",
        "ingList": [
            {
                "ing": "Mushrooms",
                "amount": "30g"
            },
            {
                "ing": "Chestnuts",
                "amount": "240g"
            },
            {
                "ing": "Challots",
                "amount": "3"
            },
            {
                "ing": "Garlic",
                "amount": "3 cloves"
            },
            {
                "ing": "Rosemary",
                "amount": "3 sprigs"
            },
            {
                "ing": "Wild Mushrooms",
                "amount": "500g"
            },
            {
                "ing": "Soy Sauce",
                "amount": "2 tblsp "
            },
            {
                "ing": "White Wine",
                "amount": "125ml "
            },
            {
                "ing": "Lasagne Sheets",
                "amount": "350g"
            },
            {
                "ing": "Breadcrumbs",
                "amount": "4 tbsp"
            },
            {
                "ing": "Sage",
                "amount": "1/2 handful "
            },
            {
                "ing": "Truffle Oil",
                "amount": "to serve"
            }
        ],
        "steps": [
            "Soak the dried mushrooms in 350ml boiling water and set aside until needed. Blitz ¾ of the chestnuts with 150ml water until creamy. Roughly chop the remaining chestnuts.",
            "Heat 2 tbsp olive oil in a large non-stick frying pan. Fry the shallots with a pinch of salt until softened, then add the garlic, chopped chestnuts and rosemary, and fry for 2 mins more. Add the wild mushrooms, 2 tbsp oil and some seasoning. Cook for 3 mins until they begin to soften. Drain and roughly chop the dried mushrooms (reserve the soaking liquid), then add those too, along with the soy sauce, and fry for 2 mins more.",
            "Whisk the wine, reserved mushroom liquid and chestnut cream together to create a sauce. Season, then add half to the mushroom mixture in the pan and cook for 1 min until the sauce becomes glossy. Remove and discard the rosemary sprigs, then set the mixture aside.",
            "Heat oven to 180C/160C fan/gas 4. Bring a large pan of salted water to the boil and get a large bowl of ice water ready. Drop the lasagne sheets into the boiling water for 2 mins or until pliable and a little cooked, then immediately plunge them into the cold water. Using your fingers, carefully separate the sheets and transfer to a clean tea towel. Spread a good spoonful of the sauce on the bottom two thirds of each sheet, then, rolling away from yourself, roll up the shorter ends. Cut each roll in half, then position the rolls of pasta cut-side up in a pie dish that you are happy to serve from at the table. If you have any mushroom sauce remaining after you’ve rolled up all the sheets, simply push it into some of the exposed rolls of pasta.",
            "Pour the rest of the sauce over the top of the pasta, then bake for 10 mins or until the pasta no longer has any resistance when tested with a skewer.",
            "Meanwhile, put the breadcrumbs, the last 2 tbsp olive oil, sage leaves and some seasoning in a bowl, and toss everything together. Scatter the rotolo with the crumbs and sage, then bake for another 10 mins, until the top is golden and the sage leaves are crispy. Leave to cool for 10 mins to allow the pasta to absorb the sauce, then drizzle with a little truffle oil, if you like, before taking your dish to the table."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/ssyqwr1511451678.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=GNN7_ZSJ5YE",
        "tags": ["Vegetarian", "Nutty"]
    },
    {
        "title": "Matar Paneer",
        "category": "Vegetarian",
        "region": "Indian",
        "ingList": [
            {
                "ing": "Sunflower Oil",
                "amount": "1 tbls"
            },
            {
                "ing": "Paneer",
                "amount": "225g"
            },
            {
                "ing": "Ginger",
                "amount": "2"
            },
            {
                "ing": "Cumin",
                "amount": "1 tsp "
            },
            {
                "ing": "Turmeric",
                "amount": "1 tsp "
            },
            {
                "ing": "Coriander",
                "amount": "1 tsp "
            },
            {
                "ing": "Green Chilli",
                "amount": "1"
            },
            {
                "ing": "Tomato",
                "amount": "4 large"
            },
            {
                "ing": "Peas",
                "amount": "150g"
            },
            {
                "ing": "Garam Masala",
                "amount": "1 tsp "
            },
            {
                "ing": "Coriander",
                "amount": "Small bunch"
            },
            {
                "ing": "Naan Bread",
                "amount": "to serve"
            }
        ],
        "steps": [
            "Heat the oil in a frying pan over high heat until it’s shimmering hot. Add the paneer, then turn the heat down a little. Fry until it starts to brown at the edges, then turn it over and brown on each side – the paneer will brown faster than you think, so don’t walk away. Remove the paneer from the pan and drain on kitchen paper.",
            "Put the ginger, cumin, turmeric, ground coriander and chilli in the pan, and fry everything for 1 min. Add the tomatoes, mashing them with the back of a spoon and simmer everything for 5 mins until the sauce smells fragrant. Add a splash of water if it’s too thick. Season well. Add the peas and simmer for a further 2 mins, then stir in the paneer and sprinkle over the garam masala. Divide between two bowls, top with coriander leaves and serve with naan bread, roti or rice."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/xxpqsy1511452222.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=wlseYNqwLNs",
        "tags": ["Curry", "Vegetarian"]
    },
    {
        "title": "Minced Beef Pie",
        "category": "Beef",
        "region": "British",
        "ingList": [
            {
                "ing": "Vegetable Oil",
                "amount": "2 tbs"
            },
            {
                "ing": "Minced Beef",
                "amount": "500g"
            },
            {
                "ing": "Onion",
                "amount": "1 chopped"
            },
            {
                "ing": "Tomato Puree",
                "amount": "1 tbls"
            },
            {
                "ing": "Plain Flour",
                "amount": "1 ½ tbsp"
            },
            {
                "ing": "Mushrooms",
                "amount": "75g"
            },
            {
                "ing": "Beef Stock",
                "amount": "250ml"
            },
            {
                "ing": "Worcestershire Sauce",
                "amount": "Dash"
            },
            {
                "ing": "Shortcrust Pastry",
                "amount": "400g"
            },
            {
                "ing": "Egg Yolks",
                "amount": "1"
            }
        ],
        "steps": [
            "Preheat the oven to 200C/400F/Gas 6.",
            "Heat the oil in a deep frying pan and fry the beef mince for 4-5 minutes, breaking it up with a wooden spoon as it browns.",
            "Add the onion and cook for 2-3 minutes, then stir in the tomato purée and cook for 2-3 more minutes. Stir in the flour and cook for a further minute, then add the chopped mushrooms, the stout or beef stock and a couple of dashes of Worcestershire sauce. Bring to the boil, then reduce the heat, cover the pan with a lid and leave to simmer for 20 minutes. Set aside and leave to cool, then turn the meat mixture into a one litre pie dish.",
            "Roll out the pastry on a floured work surface until it is slightly larger than the pie dish. Gently drape the pastry over the dish, pressing firmly onto the edges. Trim, then shape the edges into a fluted shape.",
            "Cut some leaf shapes out of the pastry trimmings and decorate the top of the pie, sticking them to the pastry with the beaten egg yolk.",
            "Make three or four slits in the pastry to allow the steam to escape, then brush the pie with the rest of the beaten egg yolk and bake in the oven for 20-25 minutes, or until golden-brown.",
            "To serve, slice into wedges."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/xwutvy1511555540.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=QY47h-uqq5g",
        "tags": ["Pie", "Meat"]
    },
    {
        "title": "McSinghs Scotch pie",
        "category": "Lamb",
        "region": "British",
        "ingList": [
            {
                "ing": "Cumin",
                "amount": "2 tsp"
            },
            {
                "ing": "Rapeseed Oil",
                "amount": "1 tbs"
            },
            {
                "ing": "Red Onions",
                "amount": "2 finely chopped"
            },
            {
                "ing": "Garlic Clove",
                "amount": "6"
            },
            {
                "ing": "Green Chilli",
                "amount": "3 finely chopped"
            },
            {
                "ing": "Red Pepper",
                "amount": "1 finely chopped "
            },
            {
                "ing": "Nutmeg",
                "amount": "1 tsp "
            },
            {
                "ing": "Coriander",
                "amount": "2 tsp"
            },
            {
                "ing": "Lamb Mince",
                "amount": "1kg"
            },
            {
                "ing": "Pepper",
                "amount": "1 tsp "
            },
            {
                "ing": "Coriander",
                "amount": "3 tbs"
            },
            {
                "ing": "Plain Flour",
                "amount": "340g"
            },
            {
                "ing": "Salt",
                "amount": "½ tsp"
            },
            {
                "ing": "Milk",
                "amount": "90 ml "
            },
            {
                "ing": "Lard",
                "amount": "150g"
            },
            {
                "ing": "Egg Yolks",
                "amount": "Beaten"
            }
        ],
        "steps": [
            "Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in the same pan and fry the onion, garlic, chilli, pepper and a good pinch of salt for around eight minutes, until there is no moisture left. Remove from the heat, stir in the toasted cumin seeds, ground mace (or nutmeg) and ground coriander. Leave to cool.",
            "In a large bowl mix together the minced lamb, white pepper, fresh coriander, and the cooled spiced onion mixture until combined. Set aside, covered, in the fridge.",
            "Preheat the oven to 200C/400F/Gas 6 and generously grease a 20cm/8in diameter loose-bottomed or springform round cake tin with lard.",
            "To make the pastry, sift the flour and salt in a large bowl and make a well in the centre.",
            "Put the milk, lard and 90ml/3fl oz of water in a saucepan and heat gently. When the lard has melted, increase the heat and bring to the boil.",
            "Pour the boiling liquid into the flour, and use a wooden spoon to combine until cool enough to handle. Bring together into a ball.",
            "Dust a work surface with flour and, working quickly, knead the dough briefly – it will be soft and moist. Set aside a third of the pastry and roll the rest out on a well-floured surface. Line the pie dish with the pastry, pressing it right up the sides until it pokes just over the top of the tin.",
            "Add the filling into the pastry-lined tin bit by bit. As you reach the top, form a slight peak. Roll out the reserved pastry and top the pie with it. Pinch the edges to seal and trim the excess. Poke a hole in the top of the pie and insert a small tube made from aluminium foil to allow steam to escape.",
            "Brush the top of the pie with a little beaten egg yolk, and bake in the preheated oven for 30 minutes (put a tray on the shelf below to catch any drips). Then reduce the temperature to 160C/325F/Gas 3 and cook for a further 1¼ hours until golden-brown. Leave to cool completely before refrigerating for two hours, or overnight.",
            "Run a knife around the edge of the pie, remove from the tin and serve with chutneys, salads or pickles."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=1nArqhRyszw",
        "tags": ["Pie"]
    },
    {
        "title": "Madeira Cake",
        "category": "Dessert",
        "region": "British",
        "ingList": [
            {
                "ing": "Butter",
                "amount": "175g"
            },
            {
                "ing": "Caster Sugar",
                "amount": "175g"
            },
            {
                "ing": "Eggs",
                "amount": "3"
            },
            {
                "ing": "Self-raising Flour",
                "amount": "250g"
            },
            {
                "ing": "Milk",
                "amount": "3 tbs"
            },
            {
                "ing": "Lemon",
                "amount": "Zest of 1"
            },
            {
                "ing": "Mixed Peel",
                "amount": "To Glaze"
            }
        ],
        "steps": [
            "Pre-heat the oven to 180C/350F/Gas 4. Grease an 18cm/7in round cake tin, line the base with greaseproof paper and grease the paper.",
            "Cream the butter and sugar together in a bowl until pale and fluffy. Beat in the eggs, one at a time, beating the mixture well between each one and adding a tablespoon of the flour with the last egg to prevent the mixture curdling.",
            "Sift the flour and gently fold in, with enough milk to give a mixture that falls slowly from the spoon. Fold in the lemon zest.",
            "Spoon the mixture into the prepared tin and lightly level the top. Bake on the middle shelf of the oven for 30-40 minutes, or until golden-brown on top and a skewer inserted into the centre comes out clean.",
            "Remove from the oven and set aside to cool in the tin for 10 minutes, then turn it out on to a wire rack and leave to cool completely.",
            "To serve, decorate the cake with the candied peel."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/urtqut1511723591.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=-YDh4WEmK_E",
        "tags": ["Cake", "Light", "Baking", "Desert"]
    },
    {
        "title": "Montreal Smoked Meat",
        "category": "Beef",
        "region": "Canadian",
        "ingList": [
            {
                "ing": "Beef Brisket",
                "amount": "1"
            },
            {
                "ing": "Salt",
                "amount": "3 tbs"
            },
            {
                "ing": "Black Pepper",
                "amount": "3 tbs"
            },
            {
                "ing": "Coriander",
                "amount": "1 tbs"
            },
            {
                "ing": "Sugar",
                "amount": "1 tbs"
            },
            {
                "ing": "Bay Leaf",
                "amount": "1 tsp "
            },
            {
                "ing": "Cloves",
                "amount": "1 tsp "
            },
            {
                "ing": "Black Pepper",
                "amount": "3 tbs"
            },
            {
                "ing": "Coriander",
                "amount": "1 tbs"
            },
            {
                "ing": "Paprika",
                "amount": "1 tbs"
            },
            {
                "ing": "Garlic",
                "amount": "1 tbs"
            },
            {
                "ing": "Onion",
                "amount": "1 tbs"
            },
            {
                "ing": "Dill",
                "amount": "1 tbs"
            },
            {
                "ing": "English Mustard",
                "amount": "1 tsp "
            },
            {
                "ing": "Celery Salt",
                "amount": "1 tbs"
            },
            {
                "ing": "Red Pepper Flakes",
                "amount": "1 tsp "
            }
        ],
        "steps": [
            "To make the cure, in a small bowl mix together salt, pink salt, black pepper, coriander, sugar, bay leaf, and cloves. Coat entire brisket with the cure and place in an extra-large resealable plastic bag. Place in the coldest part of the refrigerator and cure for 4 days, flipping brisket twice a day.",
            "Remove brisket from bag and wash as much cure off as possible under cold running water. Place brisket in a large container and fill with water and let soak for 2 hours, replacing water every 30 minutes. Remove from water and pat dry with paper towels.",
            "To make the rub, mix together black pepper, coriander, paprika, garlic powder, onion powder, dill weed, mustard, celery seed, and crushed red papper in a small bowl. Coat entire brisket with the rub.",
            "Fire up smoker or grill to 225 degrees, adding chunks of smoking wood chunks when at temperature. When wood is ignited and producing smoke, place brisket in, fat side up, and smoke until an instant read thermometer registers 165 degrees when inserted into thickest part of the brisket, about 6 hours.",
            "Transfer brisket to large roasting pan with V-rack. Place roasting pan over two burners on stovetop and fill with 1-inch of water. Bring water to a boil over high heat, reduce heat to medium, cover roasting pan with aluminum foil, and steam brisket until an instant read thermometer registers 180 degrees when inserted into thickest part of the meat, 1 to 2 hours, adding more hot water as needed.",
            "Transfer brisket to cutting board and let cool slightly. Slice and serve, preferably on rye with mustard."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/uttupv1511815050.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=g5oCDoyxbBk",
        "tags": ["Speciality", "Snack", "StrongFlavor"]
    },
    {
        "title": "Ma Po Tofu",
        "category": "Beef",
        "region": "Chinese",
        "ingList": [
            {
                "ing": "Tofu",
                "amount": "450g"
            },
            {
                "ing": "Minced Beef",
                "amount": "100g "
            },
            {
                "ing": "Sesame Seed Oil",
                "amount": "1/2 tbs"
            },
            {
                "ing": "Doubanjiang",
                "amount": "1 1/2 tsp "
            },
            {
                "ing": "Fermented Black Beans",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Pepper",
                "amount": "1 tbs"
            },
            {
                "ing": "Salt",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Sichuan pepper",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Soy Sauce",
                "amount": "1 tbs"
            },
            {
                "ing": "Water",
                "amount": "400ml"
            },
            {
                "ing": "Olive Oil",
                "amount": "2 tbs"
            },
            {
                "ing": "Scallions",
                "amount": "2 chopped"
            },
            {
                "ing": "Spring Onions",
                "amount": "4"
            },
            {
                "ing": "Garlic",
                "amount": "2 cloves chopped"
            },
            {
                "ing": "Ginger",
                "amount": "4 sliced"
            },
            {
                "ing": "Water",
                "amount": "2 1/2 tbs"
            },
            {
                "ing": "Cornstarch",
                "amount": "1 tbs"
            }
        ],
        "steps": [
            "Add a small pinch of salt and sesame oil to minced beef. Mix well and set aside.",
            "Mix 1 tablespoon of cornstarch with 2 and ½ tablespoons of water in a small bowl to make water starch.",
            "Cut tofu into square cubes (around 2cms). Bring a large amount of water to a boil and then add a pinch of salt. Slide the tofu in and cook for 1 minute. Move out and drain.",
            "Get a wok and heat up around 2 tablespoons of oil, fry the minced meat until crispy. Transfer out beef out and leave the oil in.",
            "Fry doubanjiang for 1 minute over slow fire and then add garlic, scallion white, ginger and fermented black beans to cook for 30 seconds until aroma. Then mix pepper flakes in.",
            "Add water to the seasonings and bring to boil over high fire. Gently slide the tofu cubes. Add light soy sauce and beef.Slow the heat after boiling and then simmer for 6-8 minutes. Then add chopped garlic greens.",
            "Stir the water starch and then pour half of the mixture to the simmering pot. Wait for around 30 seconds and then pour the other half. You can slightly taste the tofu and add pinch of salt if not salty enough. By the way, if you feel it is too spicy, add some sugar can milder the taste. But be carefully as the broth is very hot at this point.",
            "Transfer out when almost all the seasonings stick to tofu cubes. Sprinkle Szechuan peppercorn powder (to taste)and chopped garlic greens if using.",
            "Serve immediately with steamed rice."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/1525874812.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=IhwPQL9dFYc",
        "tags": ["Misc"]
    },
    {
        "title": "Mbuzi Choma (Roasted Goat)",
        "category": "Goat",
        "region": "Kenyan",
        "ingList": [
            {
                "ing": "Goat Meat",
                "amount": "1 kg"
            },
            {
                "ing": "Corn Flour",
                "amount": "1 kg"
            },
            {
                "ing": "Tomatoes",
                "amount": "2"
            },
            {
                "ing": "Salt",
                "amount": "Pinch"
            },
            {
                "ing": "Onion",
                "amount": "1"
            },
            {
                "ing": "Green Chilli",
                "amount": "1"
            },
            {
                "ing": "Coriander Leaves",
                "amount": "1  bunch"
            }
        ],
        "steps": [
            "1. Steps for the Meat: ",
            " Roast meat over medium heat for 50 minutes and salt it as you turn it.",
            "",
            "2. Steps for Ugali:",
            "Bring the water and salt to a boil in a heavy-bottomed saucepan. Stir in the cornmeal slowly, letting it fall through the fingers of your hand.",
            "",
            "3. Reduce heat to medium-low and continue stirring regularly, smashing any lumps with a spoon, until the mush pulls away from the sides of the pot and becomes very thick, about 10 minutes.",
            "",
            "4.Remove from heat and allow to cool.",
            "",
            "5. Place the ugali into a large serving bowl. Wet your hands with water, form a ball and serve.",
            "",
            "6. Steps for Kachumbari: Mix the tomatoes, onions, chili and coriander leaves in a bowl.",
            "",
            "7. Serve and enjoy!",
            "",
            ""
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/cuio7s1555492979.jpg",
        "videoUrl": "",
        "tags": ["BBQ", "Meat"]
    },
    {
        "title": "Mince Pies",
        "category": "Dessert",
        "region": "British",
        "ingList": [
            {
                "ing": "Butter",
                "amount": "225g"
            },
            {
                "ing": "Plain Flour",
                "amount": "350g"
            },
            {
                "ing": "Caster Sugar",
                "amount": "100g "
            },
            {
                "ing": "Mincemeat",
                "amount": "280g"
            },
            {
                "ing": "Egg",
                "amount": "1 small"
            },
            {
                "ing": "Icing Sugar",
                "amount": "Topping"
            }
        ],
        "steps": [
            "To make the pastry, rub 225g cold, diced butter into 350g plain flour, then mix in 100g golden caster sugar and a pinch of salt.",
            "",
            "Combine the pastry into a ball – don’t add liquid – and knead it briefly. The dough will be fairly firm, like shortbread dough. You can use the dough immediately, or chill for later.",
            "",
            "Preheat the oven to 200C/gas 6/fan 180C. Line 18 holes of two 12-hole patty tins, by pressing small walnut-sized balls of pastry into each hole.",
            "",
            "Spoon 280g mincemeat into the pies.",
            "",
            "Take slightly smaller balls of pastry than before and pat them out between your hands to make round lids, big enough to cover the pies. ",
            "",
            "Top the pies with their lids, pressing the edges gently together to seal – you don’t need to seal them with milk or egg as they will stick on their own. (The pies may now be frozen for up to 1 month).",
            "",
            "Beat 1 small egg and brush the tops of the pies. Bake for 20 mins until golden. Leave to cool in the tin for 5 mins, then remove to a wire rack.",
            "",
            "To serve, lightly dust with icing sugar."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/qe8pf51576795532.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=PnXft7lQNJE",
        "tags": ["Christmas"]
    },
    {
        "title": "Moussaka",
        "category": "Beef",
        "region": "Greek",
        "ingList": [
            {
                "ing": "Beef",
                "amount": "500g"
            },
            {
                "ing": "Aubergine",
                "amount": "1 large"
            },
            {
                "ing": "Greek Yogurt",
                "amount": "150g"
            },
            {
                "ing": "Egg",
                "amount": "1 beaten"
            },
            {
                "ing": "Parmesan",
                "amount": "3 tbs"
            },
            {
                "ing": "Tomato",
                "amount": "400g"
            },
            {
                "ing": "Tomato Puree",
                "amount": "4 tbs"
            },
            {
                "ing": "Potatoes",
                "amount": "350g"
            }
        ],
        "steps": [
            "Heat the grill to high. Brown the beef in a deep ovenproof frying pan over a high heat for 5 mins. Meanwhile, prick the aubergine with a fork, then microwave on High for 3-5 mins until soft. Mix the yogurt, egg and parmesan together, then add a little seasoning.",
            "",
            "Stir the tomatoes, purée and potatoes in with the beef with some seasoning and heat through. Smooth the surface of the beef mixture with the back of a spoon, then slice the cooked aubergine and arrange on top. Pour the yogurt mixture over the aubergines, smooth out evenly, then grill until the topping has set and turned golden."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/ctg8jd1585563097.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=8U_29i9Qp5U",
        "tags": ["Misc"]
    },
    {
        "title": "Mulukhiyah",
        "category": "Beef",
        "region": "Egyptian",
        "ingList": [
            {
                "ing": "Mulukhiyah",
                "amount": "800g"
            },
            {
                "ing": "Onion",
                "amount": "1 chopped"
            },
            {
                "ing": "Beef",
                "amount": "300g"
            },
            {
                "ing": "Salt",
                "amount": "1 tsp "
            },
            {
                "ing": "Water",
                "amount": "1 Litre"
            },
            {
                "ing": "Garlic Clove",
                "amount": "1"
            },
            {
                "ing": "Olive Oil",
                "amount": "1/2 cup "
            }
        ],
        "steps": [
            "Saute the onions in the 3-4 tablespoons olive oil",
            "Add the beef cubes or the chicken cutlets, sear for 3-4 min on each side",
            "Add 1 liter of water or just enough to cover the meat",
            "Cook over medium heat until the meat is done (I usually do this in the pressure cooker and press them for 5 min)",
            "",
            "Add the frozen mulukhyia and stir until it thaws completely and then comes to a boil",
            "",
            "In another pan add the 1/4 to 1/2 cup of olive oil and the cloves of garlic and cook over medium low heat until you can smell the garlic (don’t brown it, it will become bitter)",
            "",
            "Add the oil and garlic to the mulukhyia and lower the heat and simmer for 5-10 minutes",
            "Add salt to taste",
            "",
            "Serve with a generous amount of lemon juice.",
            "",
            "You can serve it with some short grain rice or some pita bread"
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/x372ug1598733932.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=vWc5JzgAkIQ",
        "tags": ["Misc"]
    },
    {
        "title": "Mustard champ",
        "category": "Side",
        "region": "Irish",
        "ingList": [
            {
                "ing": "Potatoes",
                "amount": "1kg"
            },
            {
                "ing": "Milk",
                "amount": "200ml"
            },
            {
                "ing": "Butter",
                "amount": "50g"
            },
            {
                "ing": "Mustard",
                "amount": "2 tbs"
            },
            {
                "ing": "Spring Onions",
                "amount": "Bunch"
            },
            {
                "ing": "Spring Onions",
                "amount": "Bunch"
            }
        ],
        "steps": [
            "STEP 1",
            "Boil the potatoes for 15 mins or until tender. Drain, then mash.",
            "",
            "STEP 2",
            "Heat the milk and half the butter in the corner of the pan, then beat into the mash, along with the wholegrain mustard.",
            "",
            "STEP 3",
            "Gently fry the spring onions in the remaining butter for 2 mins until just soft but still a perky green. Fold into the mash and serve. Great with gammon or to top a fish pie."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/o7p9581608589317.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=_iKllHSC978",
        "tags": ["Misc"]
    },
    {
        "title": "Moroccan Carrot Soup",
        "category": "Vegetarian",
        "region": "Moroccan",
        "ingList": [
            {
                "ing": "Carrots",
                "amount": "6 chopped"
            },
            {
                "ing": "Onion",
                "amount": "1 sliced"
            },
            {
                "ing": "Garlic Clove",
                "amount": "4"
            },
            {
                "ing": "Cumin",
                "amount": "1 tsp "
            },
            {
                "ing": "Coriander",
                "amount": "1/2 tsp"
            },
            {
                "ing": "Olive Oil",
                "amount": "1 tbs"
            },
            {
                "ing": "Garam Masala",
                "amount": "1/4 tsp"
            },
            {
                "ing": "Lemon Juice",
                "amount": "1 tsp "
            }
        ],
        "steps": [
            "Step 1",
            "Preheat oven to 180° C.",
            "Step 2",
            "Combine carrots, onion, garlic, cumin seeds, coriander seeds, salt and olive oil in a bowl and mix well. Transfer on a baking tray.",
            "Step 3",
            "Put the baking tray in preheated oven and roast for 10-12 minutes or till carrots soften. Remove from heat and cool.",
            "Step 4",
            "Grind the baked carrot mixture along with some water to make a smooth paste and strain in a bowl.",
            "Step 5",
            "Heat the carrot mixture in a non-stick pan. Add two cups of water and bring to a boil. Add garam masala powder and mix. Add salt and mix well.",
            "Step 6",
            "Remove from heat, add lemon juice and mix well.",
            "Step 7",
            "Serve hot."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/jcr46d1614763831.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=7tDWOpnIhok",
        "tags": ["Misc"]
    },
    {
        "title": "Mee goreng mamak",
        "category": "Seafood",
        "region": "Malaysian",
        "ingList": [
            {
                "ing": "Peanuts",
                "amount": "50g"
            },
            {
                "ing": "Chilli",
                "amount": "15g"
            },
            {
                "ing": "Prawns",
                "amount": "10g"
            },
            {
                "ing": "Oil",
                "amount": "5 tbs"
            },
            {
                "ing": "Water",
                "amount": "750 ml "
            },
            {
                "ing": "Tamarind Paste",
                "amount": "1/2 tbs"
            },
            {
                "ing": "Potatoes",
                "amount": "250g"
            },
            {
                "ing": "Red Onions",
                "amount": "2"
            },
            {
                "ing": "Garlic Clove",
                "amount": "4"
            },
            {
                "ing": "Cabbage",
                "amount": "30g"
            },
            {
                "ing": "Chinese Broccoli",
                "amount": "30g"
            },
            {
                "ing": "Tofu",
                "amount": "1"
            },
            {
                "ing": "Soy Sauce",
                "amount": "1 tbs"
            },
            {
                "ing": "Noodles",
                "amount": "4"
            },
            {
                "ing": "Egg",
                "amount": "1"
            }
        ],
        "steps": [
            "Heat oil in a pan at medium heat. Then, add peanuts, dried chilies, dried shrimps and dhal. Fry the aromatics until fragrant. Remove from pan and leave aside.",
            "",
            "Blend fried ingredients with tamarind paste and water until fine. Then, sauté the blended ingredients in oil heated over low heat. Continue cooking until the oil separates from the paste and turns a darker shade.",
            "",
            "Skin and cut potatoes into small chunks and boil them in a pot of water until knife-tender. Once ready, remove them from the pot and leave aside. Discard water.",
            "",
            "Slice onion and fried tofu, mince garlic, cut some cabbage and Chinese flowering cabbage (choi sam). Prepare prawn fritters and cut them. Boil noodles to soften them if bought dried. Also mix black soy sauce with water.",
            "",
            "To fry one portion of mee goreng mamak, heat oil and add 1/4 of the following ingredients in this order: garlic, onion, paste. Sauté until fragrant. Optionally, add prawns.",
            "",
            "Add in 1/4 amount of tofu, boiled potatoes, cabbage, Chinese flowering cabbage and prawn fritters. Sauté for another 30 seconds.",
            "",
            "Add noodles to the wok. Add 3 tablespoons of dark soy sauce mixture. Mix evenly for the next 1 minute. Then, move the noodles to the side of the wok. Stir in an egg. Garnish with a slice of lime and slices of green chilies. To cook another plate of noodles, repeat from step 5 onwards."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/xquakq1619787532.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=pOJEmDBgtSk",
        "tags": ["Misc"]
    },
    {
        "title": "Mushroom soup with buckwheat",
        "category": "Side",
        "region": "Croatian",
        "ingList": [
            {
                "ing": "Mushrooms",
                "amount": "150g"
            },
            {
                "ing": "Buckwheat",
                "amount": "50g"
            },
            {
                "ing": "Vegetable Oil",
                "amount": "4 tbs"
            },
            {
                "ing": "Onion",
                "amount": "40g"
            },
            {
                "ing": "Garlic",
                "amount": "2 cloves"
            },
            {
                "ing": "Bay Leaf",
                "amount": "1"
            },
            {
                "ing": "Vegetable Stock Cube",
                "amount": "1tbsp"
            },
            {
                "ing": "Sour Cream",
                "amount": "50 ml "
            },
            {
                "ing": "White Wine Vinegar",
                "amount": "Dash"
            },
            {
                "ing": "Parsley",
                "amount": "Top"
            }
        ],
        "steps": [
            "Chop the onion and garlic, slice the mushrooms and wash the buckwheat. Heat the oil and lightly sauté the onion. Add the mushrooms and the garlic and continue to sauté. Add the salt, vegetable seasoning, buckwheat and the bay leaf and cover with water. Simmer gently and just before it is completely cooked, add pepper, sour cream mixed with flour, the chopped parsley and vinegar to taste."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/1ngcbf1628770793.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=M1ok7mG9-Qc",
        "tags": ["Warming", " Soup"]
    }
]
