[
    {
        "title": "Nutty Chicken Curry",
        "category": "Chicken",
        "region": "Indian",
        "ingList": [
            {
                "ing": "Red Chilli",
                "amount": "1 large"
            },
            {
                "ing": "Ginger",
                "amount": "0.5"
            },
            {
                "ing": "Garlic",
                "amount": "1 large"
            },
            {
                "ing": "Coriander",
                "amount": "Bunch"
            },
            {
                "ing": "Sunflower Oil",
                "amount": "1 tbsp"
            },
            {
                "ing": "Chicken Breasts",
                "amount": "4"
            },
            {
                "ing": "Peanut Butter",
                "amount": "5 tblsp "
            },
            {
                "ing": "Chicken Stock",
                "amount": "150ml"
            },
            {
                "ing": "Greek Yogurt",
                "amount": "200g"
            }
        ],
        "steps": [
            "Finely slice a quarter of the chilli, then put the rest in a food processor with the ginger, garlic, coriander stalks and one-third of the leaves. Whizz to a rough paste with a splash of water if needed.",
            "Heat the oil in a frying pan, then quickly brown the chicken chunks for 1 min. Stir in the paste for another min, then add the peanut butter, stock and yogurt. When the sauce is gently bubbling, cook for 10 mins until the chicken is just cooked through and sauce thickened. Stir in most of the remaining coriander, then scatter the rest on top with the chilli, if using. Eat with rice or mashed sweet potato."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/yxsurp1511304301.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=nSQNfZxOdeU",
        "tags": ["Misc"]
    },
    {
        "title": "New York cheesecake",
        "category": "Dessert",
        "region": "American",
        "ingList": [
            {
                "ing": "Butter",
                "amount": "85g"
            },
            {
                "ing": "Sour Cream",
                "amount": "140g"
            },
            {
                "ing": "Sugar",
                "amount": "1tbsp"
            },
            {
                "ing": "Cream Cheese",
                "amount": "900g"
            },
            {
                "ing": "Caster Sugar",
                "amount": "250g"
            },
            {
                "ing": "Plain Flour",
                "amount": "3 tbs"
            },
            {
                "ing": "Lemon Juice",
                "amount": "1 ½ teaspoons"
            },
            {
                "ing": "Eggs",
                "amount": "3 Large"
            },
            {
                "ing": "Sour Cream",
                "amount": "250ml"
            },
            {
                "ing": "Sour Cream",
                "amount": "150ml"
            },
            {
                "ing": "Caster Sugar",
                "amount": "1 tbsp"
            },
            {
                "ing": "Lemon Juice",
                "amount": "2 tsp"
            }
        ],
        "steps": [
            "Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium pan. Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling.",
            "For the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a table top mixer fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice.",
            "Swap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy.",
            "Brush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools.",
            "Combine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight.",
            "Run a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/swttys1511385853.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=tspdJ6hxqnc",
        "tags": ["Desert", "Dairy", "Pudding", "Cake", "Breakfast"]
    },
    {
        "title": "Nanaimo Bars",
        "category": "Dessert",
        "region": "Canadian",
        "ingList": [
            {
                "ing": "Custard",
                "amount": "125g"
            },
            {
                "ing": "Caster Sugar",
                "amount": "50g"
            },
            {
                "ing": "Cocoa",
                "amount": "5 tbs"
            },
            {
                "ing": "Egg",
                "amount": "1 beaten"
            },
            {
                "ing": "Digestive Biscuits",
                "amount": "200g shredded"
            },
            {
                "ing": "Desiccated Coconut",
                "amount": "100g "
            },
            {
                "ing": "Almonds",
                "amount": "50g"
            },
            {
                "ing": "Butter",
                "amount": "100g "
            },
            {
                "ing": "Double Cream",
                "amount": "4 tbs"
            },
            {
                "ing": "Custard Powder",
                "amount": "3 tbs"
            },
            {
                "ing": "Icing Sugar",
                "amount": "250g"
            },
            {
                "ing": "Dark Chocolate",
                "amount": "150g"
            },
            {
                "ing": "Butter",
                "amount": "50g"
            }
        ],
        "steps": [
            "Start by making the biscuit base. In a bowl, over a pan of simmering water, melt the butter with the sugar and cocoa powder, stirring occasionally until smooth. Whisk in the egg for 2 to 3 mins until the mixture has thickened. Remove from heat and mix in the biscuit crumbs, coconut and almonds if using, then press into the base of a lined 20cm square tin. Chill for 10 mins.",
            "For the middle layer, make the custard icing; whisk together the butter, cream and custard powder until light and fluffy, then gradually add the icing sugar until fully incorporated. Spread over the bottom layer and chill in the fridge for at least 10 mins until the custard is no longer soft.",
            "Melt the chocolate and butter together in the microwave, then spread over the chilled bars and put back in the fridge. Leave until the chocolate has fully set (about 2 hrs). Take the mixture out of the tin and slice into squares to serve."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/vwuprt1511813703.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=MMrE4I1ZtWo",
        "tags": ["Treat", "Snack", "Dairy"]
    },
    {
        "title": "Nasi lemak",
        "category": "Seafood",
        "region": "Malaysian",
        "ingList": [
            {
                "ing": "Coconut Milk",
                "amount": "2 cups "
            },
            {
                "ing": "Water",
                "amount": "2 cups "
            },
            {
                "ing": "Ginger Paste",
                "amount": "1/4 tsp"
            },
            {
                "ing": "Ginger",
                "amount": "1"
            },
            {
                "ing": "Bay Leaf",
                "amount": "1"
            },
            {
                "ing": "Rice",
                "amount": "2 cups "
            },
            {
                "ing": "Eggs",
                "amount": "4"
            },
            {
                "ing": "Cucumber",
                "amount": "1"
            },
            {
                "ing": "Peanuts",
                "amount": "1 cup "
            },
            {
                "ing": "Anchovy Fillet",
                "amount": "4 oz "
            },
            {
                "ing": "Vegetable Oil",
                "amount": "2 tbs"
            },
            {
                "ing": "Onion",
                "amount": "1"
            },
            {
                "ing": "Garlic",
                "amount": "3 cloves"
            },
            {
                "ing": "Shallots",
                "amount": "3"
            },
            {
                "ing": "Chilli Powder",
                "amount": "2 tsp"
            },
            {
                "ing": "Anchovy Fillet",
                "amount": "4 oz "
            },
            {
                "ing": "Sugar",
                "amount": "3 tbs"
            },
            {
                "ing": "Tamarind Paste",
                "amount": "1/3 cup"
            }
        ],
        "steps": [
            "In a medium saucepan over medium heat, stir together coconut milk, water, ground ginger, ginger root, salt, bay leaf, and rice. Cover, and bring to a boil. Reduce heat, and simmer for 20 to 30 minutes, or until done.",
            "",
            " Step 2",
            "Place eggs in a saucepan, and cover with cold water. Bring water to a boil, and immediately remove from heat. Cover, and let eggs stand in hot water for 10 to 12 minutes. Remove eggs from hot water, cool, peel and slice in half. Slice cucumber.",
            "",
            " Step 3",
            "Meanwhile, in a large skillet or wok, heat 1 cup vegetable oil over medium-high heat. Stir in peanuts and cook briefly, until lightly browned. Remove peanuts with a slotted spoon and place on paper towels to soak up excess grease. Return skillet to stove. Stir in the contents of one package anchovies; cook briefly, turning, until crisp. Remove with a slotted spoon and place on paper towels. Discard oil. Wipe out skillet.",
            "",
            " Step 4",
            "Heat 2 tablespoons oil in the skillet. Stir in the onion, garlic, and shallots; cook until fragrant, about 1 or 2 minutes. Mix in the chile paste, and cook for 10 minutes, stirring occasionally. If the chile paste is too dry, add a small amount of water. Stir in remaining anchovies; cook for 5 minutes. Stir in salt, sugar, and tamarind juice; simmer until sauce is thick, about 5 minutes.",
            "",
            " Step 5",
            "Serve the onion and garlic sauce over the warm rice, and top with peanuts, fried anchovies, cucumbers, and eggs."
        ],
        "imgUrl": "https://www.themealdb.com/images/media/meals/wai9bw1619788844.jpg",
        "videoUrl": "https://www.youtube.com/watch?v=IUIs4C86Ilo",
        "tags": ["Misc"]
    }
]
